{"/about":{"title":"About","data":{"":"This is the about page! This page is shown on the navbar."}},"/content":{"title":"Content","data":{}},"/content/components":{"title":"Components","data":{}},"/content/components/card":{"title":"Card","data":{}},"/content/components/hero":{"title":"Hero","data":{}},"/content/components/map":{"title":"Map","data":{}},"/content/components/scroll":{"title":"Scroll","data":{}},"/content/components/slider":{"title":"Slider","data":{}},"/content/components/timeline":{"title":"Timeline","data":{}},"/content/components/viewer":{"title":"Viewer","data":{}},"/content/layout":{"title":"Layout","data":{}},"/content/markdown":{"title":"Markdown","data":{}},"/content/navigation":{"title":"Navigation","data":{}},"/customize":{"title":"Customize","data":{}},"/customize/featured":{"title":"Featured","data":{}},"/customize/locale":{"title":"Locale","data":{}},"/customize/metadata":{"title":"Metadata","data":{}},"/customize/search":{"title":"Search","data":{}},"/customize/theme":{"title":"Theme","data":{}},"/customize/viewer":{"title":"Viewer","data":{}},"/deploy":{"title":"Deploy","data":{"":"Canopy-IIIF can be easily deployed to GitHub pages or any JAMstack hosting service.The following sections will guide you through the process of deploying Canopy-IIIF to a few of these options.\nDeploying to GitHub Pages\nDeploying to Vercel"}},"/deploy/github":{"title":"GitHub","data":{"":"Hosting on GitHub Pages can be done easily\nin just a few steps.\nClick the \"Use this template\" button at the top of the Canopy-IIIF\nrepository to create a new repository based on this template. Select \"Create a new repository\" and choose the GitHub\naccount or organization you want to copy the contents to from the Owner dropdown. Choose a name for your new repository\nand entire it in the Repository name field. Unless you have a paid GitHub account, select Public. Click the\n\"Create repository\" button to create the new repository.\nOnce the repository is created, press the Settings button and Actions → General under Code and automation.\nThen select Read and write permissions under Workflow permissions and press Save. This allows the GitHub\nworkflow to run and the static Canopy output to be deployed to a new branch.\nNext, modify the .github/workflows/gh-pages.deploy.yml file in repository for the NEXT_PUBLIC_URL and NEXT_PUBLIC_BASE_PATH\nto be relative to the new repository. After changing these settings, commit your change and trigger the action to run.\nOnce the action has run, the action indicator should change from a red X to a green check mark and a new branch called\ngh-pages will be created.\nOnce the gh-pages branch exists and the action indicator is a green check mark, again press the Settings button.\nUnder Code and automation, click Pages and select gh-pages from the Branch dropdown under Build and deployment\nand click *Save. Now your Canopy site will be active at the URL you defined in the NEXT_PUBLIC_URL setting."}},"/deploy/vercel":{"title":"Vercel","data":{"":"Canopy-IIIF can also be easily hosted on Vercel. To do so, you'll need to create a hobby account\non Vercel and link it to your GitHub account. Once you've done that, you can deploy your own copy of Canopy-IIIF to\nVercel by following these steps:\nAfter you've logged in to Vercel, click the Start deploying button. Then, from the Let's Build Something New\nscreen, click the Import button next to the repository you've created.\nNext, give your repository a name a press Deploy. Vercel will then build and deploy your application and make it\navailable at ${YOUR-PROJECT-NAME}.vercel.app.\nFinally, edit the .env in your repository on Github and make sure that the NEXT_PUBLIC_URL variable and\nNEXT_PUBLIC_BASE_PATH variables match your project in Vercel. By default, the NEXT_PUBLIC_URL variable should be\nsimilar to your project name and you should not have to modify NEXT_PUBLIC_BASE_PATH."}},"/":{"title":"Canopy IIIF","data":{"":"A purely IIIF sourced static site generator using Next.js. Canopy is an application that will build a browseable and searchable digital collections style static site entirely from a IIIF Collection and the items it contains."}},"/setup":{"title":"Setup","data":{}},"/setup/configuration":{"title":"Configuration","data":{}},"/setup/development":{"title":"Development","data":{}},"/setup/getting-started":{"title":"Getting Started","data":{}}}