{"/about":{"title":"About","data":{"":"The project name \"Canopy\" is inspired by the tree motiff in the presentation, A Tree's Strength Is Its Trunk: IIIF as Central Operational Infrastructure, delivered by M.A. Matienzo (formerly Stanford University Libraries) and Esmé Cowles (Princeton University Library) at the CNI Fall 2020 Virtual Membership Meeting. Following this infrastructure vision, Canopy was created as a front end solution for rapid and easy creation of static sites using a IIIF Collection and its Manifests.Canopy IIIF is created using Next.js 13, with a FlexSearch index for text search, IIIF Presentation API 3.0 delivering resource content, Radix UI and Stitches used throughout for the user interface, and various community modules from IIIF Commons and Samvera supporting the work presentation and resource delivery.","origination#Origination":"Canopy was initially conceived at the University of Tennessee Libraries in the Summer '21 as a statically generated web application for the Rising from the Ashes: The Chimney Tops 2 Wildfires Oral History Project. This project was generated from a single IIIF Collection; however, the components delivering the user interface became heavily tailored to the source material of the Rising from the Ashes project, thus limiting the reuse of the codebase for other collections. The original Canopy featured a heavily integrated IIIF A/V Viewer designed to deliver Sound and Video resources. This A/V viewer would eventually evolve into a partial inspiration for Clover IIIF.Canopy was reimagined as Canopy IIIF in early Winter '22 with the primary focus of the project maintaining the the ability to build an interoperable site from any IIIF Collection following IIIF Presentation API 2.0 and 3.0 specifications.","contributors#Contributors":"Creators\nMat Jordan - Northwestern University\nLibraries, formerly University of Tennessee Libraries\nMark Baggett - University of Tennessee\nLibraries\nAdam Arling - Northwestern University\nLibraries\nAdditional Credits\nEmily Gore - University of Georgia Libraries, formerly University of Tennessee\nLibraries\nDavid Schober - Northwestern University Libraries\nMartim Passos - Instituto Moreira Salles\nTarje Lavik - University of Bergen Library"}},"/configuration":{"title":"Configuration","data":{"":"The Canopy IIIF build process is configured at config/canopy.json if it exists. If this configuration file has not been created, the default configuration config/.default/canopy.default.json will be used as a fallback for demonstration purposes.\nSee the Create a Project guide for a step-by-step guide\nillustrating the setup of Canopy IIIF project.","configuration-options#Configuration options":"Canopy IIIF is a highly configurable application that can be tailored to the needs of a project. Canopy configurations fallback to default settings if not customized.","properties#Properties":"A custom Canopy configuration is created at config/canopy.json. The file must be a valid JSON and contain a collection property with a valid IIIF Collection URI.\nProperty\tType\tDescription\tcollection\tstring\tIIIF Collection URI\tdevCollection\tstring\tIIIF Collection URI\tlabel\tlabel \tIIIF Presentation 3.0 label property\tsummary\tsummary\tIIIF Presentation 3.0 summary property\tfeatured\tArray<string>\tArray of IIIF Manifest URIs\tmetadata\tArray<string>\tArray of metadata labels","collection#collection":"The collection property is required and must be the URI of the referenced source IIIF Collection. Also, the id property on the IIIF Collection must match this value. Collections referencing other Collections in their items property are not currently supported.\n\"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/1c2e2200-c12d-4c7f-8b87-a935c349898a?as=iiif&size=500\"","devcollection#devCollection":"The optional devCollection property is used only when running the development server using npm run dev. Like collection, the value must be the URI of the referenced source IIIF Collection and must match its id. The devCollection property is useful when working with a large IIIF Collection and you want to target a smaller subset of the collection for development purposes.\n\"devCollection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/1c2e2200-c12d-4c7f-8b87-a935c349898a?as=iiif&size=25\"","label-and-summary#label and summary":"The Canopy IIIF site title and description respectively default to the label and summary (if set) IIIF Presentation API properties of the source IIIF Collection resource. You can optionally override these values by providing valid Presentation 3.0 label and summary properties. These values are transformed to meta elements in the <head> of the HTML document.\n\"label\": {\n  \"none\": [\"Maps of Africa, 1561-1908\"]\n},\n\"summary\": {\n  \"none\": [\n    \"113 antique maps of Africa and accompanying text dating from the mid-16th Century to the early 20th Century.\"\n  ]\n}","featured#featured":"You can inform Canopy IIIF of featured Manifests by providing an array of Manifest URIs matching the id value of resources in your source IIIF Collection. These must be referenced within the source IIIF Collection resource and the Manifest URIs must be an exact string match. These Manifests will render throughout the interface in featured components.Warning: In the current release, featured Manifests must have an Image body on the first Canvas.\n\"featured\": [\n  \"https://api.dc.library.northwestern.edu/api/v2/works/24395a20-5054-4ad1-8dd8-04a230f4740b?as=iiif\",\n  \"https://api.dc.library.northwestern.edu/api/v2/works/0792fb69-efc3-4793-90e0-97362c67ac0e?as=iiif\"\n]","metadata#metadata":"Curating Metadata allows implementers of Canopy IIIF to select metadata fields that provide additional access points to end users. The fields can be specified by listing the labels of each metadata property found in the metadata property of the manifest. Metadata labels that are curated will be automatically included as featured elements on the homepage, the metadata page, linking from works, and as facets on the search page. An optimal case is a label common to all or most manifests with some in diversity of values across those resources.Note: Metadata labels are not yet BCP 47 language code aware; however, aggregation processes will make exact string comparisons regardless of language code.\n\"metadata\": [\"Subject\", \"Date\", \"Language\", \"Creator\", \"Publisher\"]","example-configuration#Example configuration":"The following is an example configuration for the 16th-Early 20th Century Maps of Africa provided by Northwestern University Libraries.\nA devCollection value is provided to target a smaller subset of 15 items for development purposes.\nTwo Manifests are featured and five metadata labels are curated.\nThe label and summary properties are overridden to provide custom values for the site title and description.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/1c2e2200-c12d-4c7f-8b87-a935c349898a?as=iiif&size=500\",\n  \"devCollection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/1c2e2200-c12d-4c7f-8b87-a935c349898a?as=iiif&size=25\",\n  \"featured\": [\n    \"https://api.dc.library.northwestern.edu/api/v2/works/24395a20-5054-4ad1-8dd8-04a230f4740b?as=iiif\",\n    \"https://api.dc.library.northwestern.edu/api/v2/works/0792fb69-efc3-4793-90e0-97362c67ac0e?as=iiif\"\n  ],\n  \"metadata\": [\"Subject\", \"Date\", \"Language\", \"Creator\", \"Publisher\"],\n  \"label\": {\n    \"none\": [\"Maps of Africa, 1561-1908\"]\n  },\n  \"summary\": {\n    \"none\": [\n      \"113 antique maps of Africa and accompanying text dating from the mid-16th Century to the early 20th Century.\"\n    ]\n  }\n}","minimal-configuration#Minimal configuration":"The following is a minimal configuration for Canopy IIIF. This is a valid configuration intended for experimentatal and demonstration purposes, however, it is not recommended for production use.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/1c2e2200-c12d-4c7f-8b87-a935c349898a?as=iiif&size=500\"\n}"}},"/configuration/locale":{"title":"Locale Preferences","data":{"":"Canopy IIIF supports locale preferences for user interface language. More than one locale can be set as options to allow users to toggle between languages. If only one locale is defined, the language toggle will not render.The default locale is English.","properties#Properties":"The locales property is optional and provides an array of preset Locales for the user interface.For each Locale, the following properties are required:\nProperty\tType\tDescription\tconfig\tstring\tPath to the locale configuration file.\tlabel\tstring\tLabel for the locale.\tlang\tstring\tBCP 47 language code for the locale.\t\n\"locales\": [\n  {\n    \"config\": \"locales/en.json\",\n    \"label\": \"English\",\n    \"lang\": \"en\"\n  }\n]","customizing-a-locale#Customizing a Locale":"User interface language strings are set through a locale configuration file located in the config/locales directory. Persons customizing a Canopy instance can add new language configurations to support their preferred locales. We welcome all pull requests to add new locales to the Canopy IIIF project.English configuration is predefined and found at config/locales/en.json\n{\n  \"footerSourceCollection\": \"Source Collection\",\n  \"footerToggleTheme\": \"Toggle Theme\",\n  \"homepageHighlightedWorks\": \"Highlighted Works\",\n  \"searchButton\": \"Search\",\n  \"searchResults\": \"Results\",\n  \"searchFilter\": \"Filter\",\n  \"searchFilterAny\": \"Any\",\n  \"searchFilterClear\": \"Clear All\",\n  \"searchFilterClose\": \"Close\",\n  \"searchFilterSubmit\": \"View Results\"\n}","multiple-locales#Multiple Locales":"If more than one locale is defined in the config/canopy.json, a select element will render in the header allowing users to toggle the defined languages. In addition, Canopy will attempt to align the language set by the user's browser with the available options. As a fallback, the first locale defined in the array will be set.As an example, if a visitor with en-US visited a Canopy instance that included both no and en as language options, the en locale configuration would be the default locale. Whereas, if a user visited this same instance with fr as their browser language, the default locale would be the no configuration.\n\"locales\": [\n  {\n    \"config\": \"locales/no.json\",\n    \"label\": \"Norsk\",\n    \"lang\": \"no\"\n  },\n  {\n    \"config\": \"locales/en.json\",\n    \"label\": \"English\",\n    \"lang\": \"en\"\n  }\n]","example-locale-configuration#Example Locale Configuration":"In this example configuration, the locales property is set to include both pt and en options. The pt locale is set as preferred locale and will be the default language for the user interface unless the user's browser language is set to en.\n{\n  \"collection\": \"https://sebastiao-lacerda.vercel.app\",\n  \"locales\": [\n    {\n      \"config\": \"locales/pt.json\",\n      \"label\": \"Português\",\n      \"lang\": \"pt\"\n    },\n    {\n      \"config\": \"locales/en.json\",\n      \"label\": \"English\",\n      \"lang\": \"en\"\n    }\n  ]\n}"}},"/configuration/map":{"title":"Map","data":{"":"A map route can be enabled to provide geographic discovery of works. This feature builds markers from geographic point features found in navPlace properties at the Manifest level. For implementation, Canopy IIIF uses Leaflet to render the map.Note: Currently, only navPlace properties found at the Manifest level are displayed. Also, only Features of type Point are displayed.\nSee the Enable a Map with navPlace for a\nstep-by-step guide.","properties#Properties":"The map property is an object that contains the configuration for the /map route and its components.\nProperty\tType\tDescription\tenabled\tboolean\tBoolean value to enable or disable the /map route. The default value is false.\tdefaultBounds\tArray\tThe defaultBounds property defines the coordinates of the initial view of the map.\ticon\tObject\tThe icon property defines the icon used to represent each marker on the map.\ttileLayers\tArray\tThe map's tile layers are also configured here, giving users the ability to choose and customize layers for their project.","enabled#enabled":"Boolean value to enable or disable the /map route. The default value is false. To enable this option, set the option to true.\n\"enabled\": true","defaultbounds#defaultBounds":"The defaultBounds property defines the coordinates of the initial view of the map. This property is an array of\narrays of longitude and latitude coordinates. Unless there are no markers found within the manifests of the\noverarching collection, this property will be ignored.\n\"defaultBounds\": [[51.505, -0.09]]","icon#icon":"The icon property defines the icon used to represent each marker on the map. The iconUrl property is the path to\nthe image file used as the icon. The iconSize property is an array of the width and height of the icon in pixels.\nThe iconAnchor property is an array of the x and y coordinates of the icon's anchor point in pixels. These values\nare used to position the icon relative to its marker's coordinates.\n\"icon\": {\n  \"iconUrl\": \"images/marker-icon.png\",\n  \"iconSize\": [24, 36],\n  \"iconAnchor\": [12, 36]\n}","tilelayers#tileLayers":"The map's tile layers are also configured here, giving users the ability to choose and customize layers for their project. Additional services, such as MapBox, can be easily integrated following this pattern. Each tile layer defined here will appear as an option in the layer control of the map. The name property defines the text next to the radio button. The url property is the link to the tile layer. Finally, the attribution property defines the text that appears at the bottom of the map in case the tile layer requires any specific attribution on use. The first tile layer in the array will be used as the default map.\n\"tileLayers\": [\n  {\n    \"name\": \"OpenStreetMap\",\n    \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n    \"attribution\": \"&copy; OpenStreetMap contributors\"\n  },\n  {\n    \"name\": \"OpenTopoMap\",\n    \"url\": \"https://{s}.tile.opentopomap.org/{z}/{x}/{y}.png\",\n    \"attribution\": \"&copy; OpenStreetMap contributors\"\n  }\n]","example-map-configuration#Example Map Configuration":"In this example, we have a IIIF Collection with Manifests having navPlace properties. The configuration enables the /map route and uses an Open Street Map tile layer.\n{\n  \"collection\": \"https://digital.lib.utk.edu/assemble/collection/gsmrc/wcc\",\n  \"featured\": [\"  https://digital.lib.utk.edu/assemble/manifest/wcc/269\"],\n  \"metadata\": [\"Place\", \"Date\", \"Subject\"],\n  \"map\": {\n    \"enabled\": true,\n    \"defaultBounds\": [[51.505, -0.09]],\n    \"icon\": {\n      \"iconUrl\": \"images/marker-icon.png\",\n      \"iconSize\": [24, 36],\n      \"iconAnchor\": [12, 36]\n    },\n    \"tileLayers\": [\n      {\n        \"name\": \"OpenStreetMap\",\n        \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n        \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n      }\n    ]\n  }\n}"}},"/configuration/search":{"title":"Search","data":{"":"Canopy IIIF utilizes FlexSearch for fast in-memory indexing and provides options for users to customize their search experience. By default Canopy will index Manifest all label and any defined metadata properties. Users can optionally index the summary property.\nSee the Customize the Search Index for a\nstep-by-step guide.","properties#Properties":"Search is customized in the Canopy configuration at config/canopy.json using the optional search property. If search is not defined, the default configuration is used.\nProperty\tType\tDescription\tenabled\tboolean\tWhether or not to enable search.\tflexSearch\tObject\tFlexSearch configuration options.\tindex\tObject\tIndexing option for Manifests.","enabled#enabled":"Boolean value to enable or disable search indexing. Default is true.\n\"enabled\": true","flexsearch#flexSearch":"Users may customize their FlexSearch configuration using search.flexSearch to fit the source Collection and its Manifest label, metadata, and summary properties. Customizations range from defining language-specific options such as charset and stemmer, as well as scoring options like resolution and depth.\n\"flexSearch\": {\n  \"charset\": \"latin:extra\",\n  \"optimize\": true,\n  \"tokenize\": \"strict\",\n  \"bidirectional\": false,\n  \"document\": {\n    \"index\": [\n      {\n        \"field\": \"label\",\n        \"tokenize\": \"full\",\n        \"resolution\": 9,\n        \"depth\": 3,\n        \"bidirectional\": true\n      },\n      {\n        \"field\": \"metadata\",\n        \"resolution\": 2\n      },\n      {\n        \"field\": \"summary\",\n        \"resolution\": 1\n      }\n    ]\n  }\n}","index#index":"Implementers can define the properties of their Manifests that are indexed. Canopy IIIF indexes the label property on the Manifest by default. Users can also index the metadata and summary properties.The metadata property is indexed by default for configured metadata labels. Furthermore, all metadata values may be indexed OR you may specify only the properties that are specified in config/canopy.json by modifying search.index.metadata.all.The summary property is not indexed by default. To enable indexing of the summary property, set search.index.summary.enabled to true.\n\"index\": {\n  \"metadata\": {\n    \"enabled\": true,\n    \"all\": false\n  },\n  \"summary\": {\n    \"enabled\": false\n  }\n}","default-search-configuration#Default Search Configuration":"The default configuration used if search is not defined in config/canopy.json.\n\"search\": {\n  \"enabled\": true,\n  \"flexSearch\": {\n    \"charset\": \"latin:extra\",\n    \"optimize\": true,\n    \"tokenize\": \"strict\",\n    \"bidirectional\": false,\n    \"document\": {\n      \"index\": [\n        {\n          \"field\": \"label\",\n          \"tokenize\": \"full\",\n          \"resolution\": 9,\n          \"depth\": 3,\n          \"bidirectional\": true\n        },\n        {\n          \"field\": \"metadata\",\n          \"resolution\": 2\n        },\n        {\n          \"field\": \"summary\",\n          \"resolution\": 1\n        }\n      ]\n    }\n  },\n  \"index\": {\n    \"metadata\": {\n      \"enabled\": true,\n      \"all\": false\n    },\n    \"summary\": {\n      \"enabled\": false\n    }\n  }\n}","example-search-configuration#Example Search Configuration":"The following example shows a configuration. You must fully define the search property when customizing the search options.In this example, we provide a source IIIF Collection having Manifests with robust summary properties. With this, we are choosing to customize the FlexSearch configuration by increasing the resolution of the summary property to 5 and then we are enabling indexing of the summary property.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/c373ecd2-2c45-45f2-9f9e-52dc244870bd?as=iiif\",\n  \"metadata\": [\"Dimensions\", \"Materials\"],\n  \"search\": {\n    \"enabled\": true,\n    \"flexSearch\": {\n      \"charset\": \"latin:extra\",\n      \"optimize\": true,\n      \"tokenize\": \"strict\",\n      \"bidirectional\": false,\n      \"document\": {\n        \"index\": [\n          {\n            \"field\": \"label\",\n            \"tokenize\": \"full\",\n            \"resolution\": 9,\n            \"depth\": 3,\n            \"bidirectional\": true\n          },\n          {\n            \"field\": \"metadata\",\n            \"resolution\": 2\n          },\n          {\n            \"field\": \"summary\",\n            \"resolution\": 5\n          }\n        ]\n      }\n    },\n    \"index\": {\n      \"metadata\": {\n        \"enabled\": true,\n        \"all\": false\n      },\n      \"summary\": {\n        \"enabled\": true\n      }\n    }\n  }\n}"}},"/content":{"title":"Content","data":{"":"Canopy allows for easy creation of contextual content to support and reference the automatically generated content in a IIIF Collection. For the purpose of easy content generation Canopy utilizes MDX which \"allows you to use JSX in your markdown content.\"\nSee the Creating Markdown Content guide for a\nstep-by-step guide illustrating basic creation of new content.","markdown-and-components#Markdown and Components":"Content is edited in the /content directory at the root of your Canopy IIIF project using .mdx files. In addition to the standard Markdown elements, Canopy IIIF provides a number of custom components that can be used to enhance the content of your site. These components are designed to be used in conjunction with Markdown to create a variety of content.","example-content#Example Content":"Content page with formatted Markdown elements, front matter, and an integrated <Viewer /> component to output a IIIF Viewer for a provided Manifest.","sample-mdx#Sample MDX":"---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nThe `<Viewer />` is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in. These Manifests can be part of the Canopy\nsource Collection but are not limited to it.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />","sample-output#Sample Output":""}},"/content/card":{"title":"Card","data":{"":"Implementers using Canopy IIIF can directly reference a single IIIF Manifest by using the Card component. The Card will render an HTML figure, the thumbnail and a figcaption containing the label of the Manifest. Use rendered figure will link to /work page for the relative Manifest.","properties#Properties":"Property\tType\tRequired\tDescription\tiiifContent\tstring\ttrue\tManifest URI to be rendered.\t\nThe referenced Manifest must be part of the IIIF Collection used in your Canopy project.","usage#Usage":"<Card iiifContent=\"https://manifests.collections.yale.edu/ycba/obj/702\" />"}},"/content/markdown":{"title":"Markdown","data":{"":"Canopy IIIF content pages are authored using Markdown in .mdx files.","elements#Elements":"Common Markdown elements are supported for use in Canopy IIIF content. Canopy will automatically transform content created in Markdown to HTML.\n# Iranian Cinema\n## Overview\nIranian cinema, also known as Persian cinema, stands out for its unique blend of artistry, storytelling, and cultural representation. It has gained significant international acclaim, especially for its poetic narrative style and sociocultural themes. Iranian cinema is a vibrant and influential part of the global film landscape, known for its poignant storytelling, artistic innovation, and cultural depth.\n## Characteristics\n- **Humanistic Approach**: Many films focus on everyday life and human relationships, reflecting broader societal issues.\n- **Artistic Storytelling**: Iranian cinema is renowned for its poetic, metaphorical narrative style.\n- **Minimalism**: There's often an emphasis on simplicity in both visual and narrative elements.\n## International Recognition\nIranian films have been celebrated at major international film festivals, including Cannes, Venice, and Berlin. Numerous awards have been won, highlighting the global impact of Iranian cinematic art.","front-matter#Front Matter":"At the top of each Markdown file, you can add front matter to provide additional information about the page. Front matter is written in YAML, and must be surrounded by --- on either side.\n---\ntitle: \"Title in Front Matter\"\n---","content-pages#Content Pages":"All new content pages created in the content directory can have the following front matter:","title#title":"The title of the page. This will be used in the HTML <title> and associated <meta> tags.","decription#decription":"The description of the page. This will be used in the HTML <head> for associated <meta> tags.","navigation#navigation":"The navigation menu for the page. This should be the relative directory path for the page. For example, if the page is in content/correspondence/, the navigation should be correspondence.","referencedmanifests#referencedManifests":"A list of IIIF Manifests URIs that are referenced in the content of the page. These Manifests MUST be a part of source IIIF Collection used for your Canopy project. These will create a link between the /work page and the current content page.\n---\ntitle: \"January 1955 Correspondence\"\ndescription: \"Seven letters of Amanda Ira Aldridge and Mihailo Kovačević\"\nnavigation: \"correspondence\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/46de2c91-3a29-4525-939e-ee17073f3a7e?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/bb968afb-7857-46bd-9392-d8617a93cc9f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/14b8212b-7c49-431b-ad04-e4cd5cce6416?as=iiif\n---","home-page#Home Page":"The home page at content/index.mdx is a special content page with distinct front matter keys in addition to title.","showhero#showHero":"A boolean value that determines whether or not the hero image for featued Manifests should be shown on the home page. This renders above the Markdown content.","showhighlighted#showHighlighted":"A boolean value that determines whether or metadata sliders for highlighted items should be shown on the home page. This renders below the Markdown content if showHero is true\n---\ntitle: Amanda Ira Aldridge Correspondences\nshowHero: true\nshowHighlighted: true\n---"}},"/content/navigation":{"title":"Navigation","data":{"":"Navigation is configured from _meta.json files located in /content.","primary-navigation#Primary Navigation":"Canopy IIIF creates it's primary navigation at build time from /content/_meta_.json. Each link will have a path and text key. A path value will resolve to a file or directory under /content or /src/pages. The text key will be what's displayed in the navigation bar. The order of the links in the array will be the order they appear in the navigation.\n[\n  {\n    \"path\": \"/works\",\n    \"text\": \"Works\"\n  },\n  {\n    \"path\": \"/metadata\",\n    \"text\": \"Metadata\"\n  },\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  }\n]\nCanopy IIIF provides the Works and Metadata pages out of the box,\npre-configured. Therefore you will not see markdown files for these pages\nunder the /content directory, though their links will resolve.\nFor a more detailed explanation of how the path value is resolved, see below.\nTechnical explanation: The path value follows the\nNext.js\npages routing convention. The path value /works will map to\n/src/pages/works/index.tsx. The path value/metadata will map to\n/src/pages/metadata.tsx.","custom-content#Custom Content":"Most users will want to add navigation for custom content to their site. For example, a user may want to customize the navigation on the About page to better fit the content of their site or create a brand new page with custom navigation. This is done by creating a markdown file under /content and adding a link to the primary navigation (as seen above).\nFor example, to add a page called Essays to the primary navigation, create a markdown file called index.mdx under /content/essays.\nIf creating a new page, try copying the content from src/pages/about into\nsrc/pages/{your_page_name}. This will give you a good starting point for\nyour new page.","secondary-navigation#Secondary Navigation":"","top-level#Top Level":"Secondary navigation may be defined from within a _meta.json file located within a subdirectory of /content. For example, secondary navigation within About might look like this:\n[\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  },\n  {\n    \"path\": \"/about/example\",\n    \"text\": \"Markdown Example\"\n  }\n]\nWhich will render top-level secondary navigation links About and Markdown Example:\nThese About secondary navigation links are wired up to route to the corresponding markdown file. For example, clicking on Markdown Example will route to /content/about/example.Markdown Example must also define a navigation frontmatter property, identifying it's parent. This is used to render the top-level secondary navigation links. For example, the Markdown Example markdown file might look like this:\n---\ntitle: About\nnavigation: \"about\"\n---\nContent goes here","internal-page-navigation#Internal Page Navigation":"Internal page navigation links (ie. \"Use Cases\", \"Features\", and \"Colophon\") are automatically generated for heading level 2 elements (## Heading) in your Markdown content. For example, the About page might look like this:\n# About\nUsing a single [IIIF Presentation Collection](https://iiif.io/api/presentation/3.0/#overview-collection) as a data source, Canopy IIIF (Canopy) generates a browseable, searchable, customizable, and contextually-driven static site using Next.js without duplicating content.\n## Use Cases\nSome content here\n## Features\nSome content here\n## Colophon\nSome content here"}},"/content/referenced-items":{"title":"Referenced Items","data":{"":"The ReferencedItems component is used in conjunection with referencedManifests front matter key to easily render a grid of Card components. The referenced items must be Manifests within the IIIF Collection used in your Canopy project.\nSee the Front Matter section in Markdown\ndocumentation for more information.","usage#Usage":"---\ntitle: \"January 1955 Correspondence\"\nnavigation: \"correspondence\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/46de2c91-3a29-4525-939e-ee17073f3a7e?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/bb968afb-7857-46bd-9392-d8617a93cc9f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/14b8212b-7c49-431b-ad04-e4cd5cce6416?as=iiif\n---\n<ReferencedItems />"}},"/content/slider":{"title":"Slider","data":{"":"Slider is a component that renders a Collection as a carousel component. Each item in the referenced IIIF Collection is rendered as an HTML figure, the thumbnail and a figcaption containing the label of the Manifest. Use rendered figure will link to /work page for the relative Manifest.","properties#Properties":"Property\tType\tRequired\tDescription\tiiifContent\tstring\ttrue\tIIIF Collection URI to be rendered.\t\nThis resource may OR may not be part of the IIIF Collection used in your Canopy project.\nIf the Collection is generated by Canopy, the homepage routes will automatically link to respective /work pages and /search facets.","usage#Usage":"<Slider iiifContent=\"/api/facet/creator/david-alfaro-siqueiros \" />"}},"/content/viewer":{"title":"Viewer","data":{"":"When creating content for Canopy, you can use the Viewer component to embed a deep-zoom and A/V capable IIIF Viewer into your content. The integrated IIIF Viewer is the Clover IIIF Viewer component","properties#Properties":"Property\tType\tRequired\tDescription\tiiifContent\tstring\ttrue\tIIIF Manifest or Collection URI to be rendered.\t\nThis resource may OR may not be part of the IIIF Collection used in your Canopy project.\nThe Viewer will render both IIIF Manifests and IIIF Collections.","usage#Usage":"<Viewer iiifContent=\"https://manifests.collections.yale.edu/ycba/obj/702\" />"}},"/create-markdown-content":{"title":"Create Markdown Content","data":{"":"Implementers of Canopy IIIF can author contextual content to support\nManifest resources using formatted Markdown files. These files are stored in\nthe /content directory of your project. In doing so, you can add context\nto items in your IIIF Collection and craft a custom experience using\nintegrated components provided by Canopy IIIF.\nThis guide assumes you have a Canopy IIIF project. See the Create a\nProject guide to get started.","use-case#Use Case":"As a digital humanist, you have authored scholarly content for distinct items in a IIIF Collection. Your aim is to publish a digital scholarship project that highlights your context alongside these items.","implementation#Implementation":"","create-a-markdown-file#Create a Markdown file":"In your content directory, find the about subdirectory and create the new file sample.mdx.\nAdd the following barebones Markdown and front matter to your file and save.\n---\ntitle: The Nez Percé (Nimíipuu)\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\nYour file is now accessible at the relative route /about/nez-perce. If running in development mode, your file is accessible at http://localhost:5001/about/nez-perce.","update-navigation-menu#Update Navigation Menu":"Add the navigation key to the front matter with the about value. In this example the about navigation menu is defined by the content/about/_meta.json file.\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\nEdit the content/about/_meta.json file and Add the new menu item to the array. Note that the /about/nez-perce path matches the relative path of the Markdown file.\n[\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  },\n  {\n    \"path\": \"/about/example\",\n    \"text\": \"Markdown Example\"\n  },\n  {\n    \"path\": \"/about/nez-perce\",\n    \"text\": \"The Nez Percé (Nimíipuu)\"\n  }\n]\nYou will see the menu rendered in the <aside> of the page after a browser refresh.","add-a-iiif-viewer#Add a IIIF Viewer":"Canopy IIIF provides a Clover IIIF Viewer component that can be used to display IIIF resources within Markdown.\nAdd a <Viewer /> component to the bottom of our Markdown file and directly reference a IIIF Manifest with the iiifContent property.\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nThe `<Viewer />` is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in. These Manifests can be part of the Canopy\nsource Collection but are not limited to it.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />\nThe IIIF viewer is now rendered at the bottom of the page. The viewer is responsive with a max-height.","reference-collection-items#Reference Collection Items":"As a digital humanist, you might have authored a series of essays in Markdown (in the /content directory), in which you wish to reference or cite one or more items in the source IIIF Collection. Canopy offers an easy method for linking scholarly content to items in their collection using the referencedManifests front matter key. This key takes an array of IIIF Manifest URIs. The Manifests MUST be in the source IIIF Collection of the Canopy project.\nAdd the referencedManifests key to the front matter with an array of Manifest URIs.\nAdd a <ReferencedItems /> component to bottom of our Markdown file. This will render the items as Figures in a responsive grid. Each item will have output relative local link to the item, a thumbnail, and the label.\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/84aec8c1-42e8-4e2c-a6b2-1c7e3790217f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/19efac1e-5e79-471c-89c2-a60a775562ce?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/ddd72f96-9869-4335-9d8c-3a3da51ad128?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/6caed4fb-60bc-4574-86a2-cb9a1859f78c?as=iiif\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nA IIIF viewer is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />\n## Referenced Items\nThe `<ReferencedItems />` automatically outputs a grid of items that are referenced by the current page.\n<ReferencedItems />\nYour page should now output a grid of items that are referenced in the front matter. Automatically, a reciprocal connection is made between the Markdown content and the items in the IIIF Collection. Users can now navigate to and from the scholarly content page and the relative /work page representing the Manifest.","leveraging-metadata-collections#Leveraging Metadata Collections":"During the Canopy build process, new unique metadata-based IIIF Collections are automatically generated from the source IIIF Collection. These Collections can be used within Markdown content to enhance user experience and your scholarly content.These new Collections are generated for label and value pairs defined of the metadata entries in a Canopy configuration file. The IIIF Collections are available at the URL pattern /api/facet/{label}/{value}.json. Generated IIIF Collections for these facets are logged in the Canopy build process, ex:\nCreating facets as IIIF Collections...\n↓ /api/facet/subject/cayuse-indians.json\n↓ /api/facet/subject/chinookan-indians.json\n↓ /api/facet/subject/nez-perce-indians.json\n↓ /api/facet/subject/tlakluit-indians.json\n↓ /api/facet/subject/umatilla-indians.json\n↓ /api/facet/subject/walla-walla-indians.json\n↓ /api/facet/date/1910.json\n↓ /api/facet/date/1909.json\n↓ /api/facet/date/1905.json\n↓ /api/facet/date/1911.json\n↓ /api/facet/date/1903.json\nAdd a <Viewer /> component to the bottom of our Markdown file and reference a collection for label of Date and value of 1905 with the iiifContent property. The iiifContent property URI can be either a relaltive or absolute path.\n<Viewer iiifContent=\"/api/facet/date/1905.json\" />\nOr, Add a <Slider /> component as an alternative view to render a carousel of items that link to the local relative /work pages representing the Manifests. This component takes the same iiifContent property. Note that this component only supports Collection resources.\n<Slider iiifContent=\"/api/facet/date/1905.json\" />\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/84aec8c1-42e8-4e2c-a6b2-1c7e3790217f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/19efac1e-5e79-471c-89c2-a60a775562ce?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/ddd72f96-9869-4335-9d8c-3a3da51ad128?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/6caed4fb-60bc-4574-86a2-cb9a1859f78c?as=iiif\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nA IIIF viewer is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />\n## Referenced Items\nThe `<ReferencedItems />` automatically outputs a grid of items that are referenced by the current page.\n<ReferencedItems />\n## Leveraging Metadata\n### Using the Viewer\nThe `<Viewer />` component supports IIIF Collections. This allows you to reference a IIIF Collection that is generated by Canopy IIIF. In this example, we are referencing a Collection of items that have a `date` of `1905`.\n<Viewer iiifContent=\"/api/facet/date/1905.json\" />\n### Using the Slider\nAlternatively, you can use the `<Slider />` component to render a carousel of items that link to the local relative `/work` pages representing the Manifests.\n<Slider iiifContent=\"/api/facet/date/1905.json\" />"}},"/create-navigation-routes":{"title":"Create Navigation Routes","data":{"":"Implementers of Canopy IIIF may want to create routes in their content/\ndirectory to fit their contextual content. This guide will walk you through\nthe process of creating a new directory and adding its pages to navigation\nmenus.\nThis guide assumes you have a Canopy IIIF project. See the Create a\nProject guide to get started.","use-case#Use Case":"As a digital scholarship librarian, you have compiled a series of essays analyzing manuscripts in a IIIF Collection provided by your institution and want to create the new directory essays to deliver this scholarly content.","implementation#Implementation":"","create-a-new-content-route#Create a New Content Route":"Create a new directory in the content/ called essays.\nAdd a new file index.mdx within it. This will act as the landing page for the new directory and be delivered at the route /essays/.\nAdd a new file three-pillars-of-islam.mdx within it. This will be a page within the new directory at the route /essays/three-pillars-of-islam/.\nThe content in this directory is NOT yet accessible. We also need to add\nthe route in /src/pages/essays to make it viewable. The routes will resolve\nafter completion of steps 1-3.","reflect-the-route-in-srcpages#Reflect the Route in src/pages/":"Copy the src/pages/about directory recursively and rename it to src/pages/essays. The essays directory will now contain the files index.tsx and [slug].tsx.\ncp -r src/pages/about src/pages/essays\nThe src/pages/essays directory will now contain the files index.tsx and [slug].tsx.","reference-the-content-directory#Reference the /content Directory":"Open /src/pages/essays/[slug].tsx and change the CONTENT_DIRECTORY variable to essays.\nSave the file.\nThis file will render content at routes content/essays/*, for example /essays/the-three-pillars-of-islam.\nThe [slug].tsx file follows a Next.js dynamic\nroute\nconvention.\n- const CONTENT_DIRECTORY = \"about\";\n+ const CONTENT_DIRECTORY = \"essays\";\nOpen /src/pages/essays/index.tsx and change the CONTENT_DIRECTORY variable to essays.\nSave the file.\nThis file will render the single page content at the route content/essays.\n- const CONTENT_DIRECTORY = \"about\";\n+ const CONTENT_DIRECTORY = \"essays\";","edit-the-primary-navigation#Edit the Primary Navigation":"To add the new route to the primary navigation in the header, we need to add the route to the _meta.json file in the content/ directory.\nOpen content/_meta.json and add the Essays route code to the array.\nSave the file.\n{\n  \"path\": \"/essays\",\n  \"title\": \"Essays\"\n}\nYour content/_meta.json file should look like this:\n[\n  {\n    \"path\": \"/works\",\n    \"title\": \"Works\"\n  },\n  {\n    \"path\": \"/metadata\",\n    \"title\": \"Metadata\"\n  },\n  {\n    \"path\": \"/essays\",\n    \"title\": \"Essays\"\n  },\n  {\n    \"path\": \"/about\",\n    \"title\": \"About\"\n  }\n]","create-the-secondary-navigation#Create the Secondary Navigation":"Finally, we want to add the secondary navigation for the Essays directory. This will render in the sidebar of our Essays content.\nCreate the new file _meta.json in the content/essays/ directory that was created earlier.\nAdd the Essays\nSave the file.\n[\n  {\n    \"path\": \"/essays\",\n    \"title\": \"Essays\"\n  },\n  {\n    \"path\": \"/essays/three-pillars-of-islam\",\n    \"title\": \"Three Pillars\"\n  }\n]\nYour file structure should have _meta.json at both content/_meta.json and content/essays/_meta.json.","edit-content-and-reference-navigation#Edit Content and Reference Navigation":"In each of the files we created, we need to add an essays value to navigation key and in our frontmatter. This will instruct the page to render the secondary navigation in the sidebar.\nOpen content/essays/index.mdx and add the content below. This will be the landing page for the Essays directory.\nSave the file.\n---\ntitle: Essays\nnavigation: \"essays\"\n---\n# Essays\nThis is the landing page for the Essays directory.\n## Introduction\nThis is the introduction to the Essays section.\nOpen content/essays/three-pillars-of-islam.mdx and add the content below. This will be the page for the essay Three Pillars of Islam.\nSave the file.\n---\ntitle: Three Pillars of Islam\nnavigation: \"essays\"\n---\n# Three Pillars of Islam\nThis is the essay `Three Pillars of Islam`.","validate-the-new-routes#Validate the New Routes":"Once completed, you will be able to navigate to the new routes.\nFrom the home page, note the Essays navigation item in the primary navigation of the header.\nFollow the Essays navigation item to the landing page /essays/ for the Essays directory.\nNote the secondary navigation in the sidebar with the items: Essays and the Three Pillars of Islam.\nFollow the Three Pillars of Islam link to your content page /essays/three-pillars-of-islam/."}},"/customize-the-search-index":{"title":"Customize the Search Index","data":{"":"Under the hood Canopy uses\nFlexSearch to power the search\nindex. FlexSearch is a full-text, memory efficient, search library that is\nfast and easy to use. It is also highly customizable. Canopy provides a\nnumber of ways to customize the search index.\nThis guide assumes you have a Canopy IIIF project. See the Create a\nProject guide to get started.","use-case#Use Case":"You'd like to use Canopy IIIF to create a digital exhibit featuring Arabic manuscripts. For example, the Arabic Manuscripts from West Africa provided by Northwestern University. The IIIF Manifest data contains both Arabic script and English text in its label and summary properties.You'd like to customize search configuration in the following three ways:\nSupport the \"Arabic\" character set in Search (in addition to default \"Latin\").\nInclude text from Manifest summary values in search results.\nInclude additional Manifest metadata in search results. In our example Manifests we include \"Contributor\" and \"Alternate Title\" as metadata items and would like to surface these in search results.","implementation#Implementation":"","add-search-configuration#Add search configuration":"Setup a Canopy IIIF project with the following configuration, including the search property with default values.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/59ec43f9-a96c-4314-9b44-9923790b371c?as=iiif&size=100\",\n  \"search\": {\n    \"enabled\": true,\n    \"flexSearch\": {\n      \"bidirectional\": false,\n      \"charset\": \"latin:extra\",\n      \"document\": {\n        \"index\": [\n          {\n            \"bidirectional\": true,\n            \"depth\": 3,\n            \"field\": \"label\",\n            \"resolution\": 9,\n            \"tokenize\": \"full\"\n          },\n          {\n            \"field\": \"metadata\",\n            \"resolution\": 2\n          },\n          {\n            \"field\": \"summary\",\n            \"resolution\": 1\n          }\n        ]\n      },\n      \"optimize\": true,\n      \"tokenize\": \"strict\"\n    },\n    \"index\": {\n      \"metadata\": {\n        \"all\": false,\n        \"enabled\": true\n      },\n      \"summary\": {\n        \"enabled\": false\n      }\n    }\n  }\n}","support-additional-language-charsets#Support additional language charsets":"Edit config/canopy.json and add the additional language encoding, arabic:extra, to the search.flexSearch.charset property. The entries should be an array of strings as we are using multiple language encodings.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/59ec43f9-a96c-4314-9b44-9923790b371c?as=iiif&size=100\",\n  \"search\": {\n    \"enabled\": true,\n    \"flexSearch\": {\n      \"bidirectional\": false,\n      \"charset\": [\"latin:extra\", \"arabic:extra\"],\n      \"document\": {\n        \"index\": [\n          {\n            \"bidirectional\": true,\n            \"depth\": 3,\n            \"field\": \"label\",\n            \"resolution\": 9,\n            \"tokenize\": \"full\"\n          },\n          {\n            \"field\": \"metadata\",\n            \"resolution\": 2\n          },\n          {\n            \"field\": \"summary\",\n            \"resolution\": 1\n          }\n        ]\n      },\n      \"optimize\": true,\n      \"tokenize\": \"strict\"\n    },\n    \"index\": {\n      \"metadata\": {\n        \"all\": false,\n        \"enabled\": true\n      },\n      \"summary\": {\n        \"enabled\": false\n      }\n    }\n  }\n}","include-summary-in-search-results#Include summary in search results":"The default search configuration indexes only\nManifest label and metadata values.\nTo include Manifest summary values in the search index, update the search.index.summary.enabled to true.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/59ec43f9-a96c-4314-9b44-9923790b371c?as=iiif&size=100\",\n  \"search\": {\n    \"enabled\": true,\n    \"flexSearch\": {\n      \"bidirectional\": false,\n      \"charset\": [\"latin:extra\", \"arabic:extra\"],\n      \"document\": {\n        \"index\": [\n          {\n            \"bidirectional\": true,\n            \"depth\": 3,\n            \"field\": \"label\",\n            \"resolution\": 9,\n            \"tokenize\": \"full\"\n          },\n          {\n            \"field\": \"metadata\",\n            \"resolution\": 2\n          },\n          {\n            \"field\": \"summary\",\n            \"resolution\": 1\n          }\n        ]\n      },\n      \"optimize\": true,\n      \"tokenize\": \"strict\"\n    },\n    \"index\": {\n      \"metadata\": {\n        \"all\": false,\n        \"enabled\": true\n      },\n      \"summary\": {\n        \"enabled\": true\n      }\n    }\n  }\n}","curate-metadata-labels-for-indexing#Curate metadata labels for indexing":"Implementers may choose to index all, part, or none of the metadata in Manifests. By default, Canopy IIIF indexes only values defined in the metadata property of config/canopy.json file.Our source IIIF Collection has Manifests with specific metadata content to index, and we want to limit this to Date, Subject, Contributor, and Alternate Title labels. In this example Manifest, the respective values of \"Translated title: Love fāʼidah with the amulet of Prophet Yūsuf\" and \"Falke, ʻUmar, 1893-1962 (Collector)\" would be included in the index.\n{\n  \"@context\": \"http://iiif.io/api/presentation/3/context.json\",\n  \"id\": \"https://api.dc.library.northwestern.edu/api/v2/works/2ca1b09b-cbad-43dd-82bf-a7fa807269d8?as=iiif\",\n  \"type\": \"Manifest\",\n  \"label\": {\n    \"none\": [\n      \"محبة مع خاتم النبي يوسف.\"\n    ]\n  },\n  \"metadata\": [\n    {\n      \"label\": {\n        \"none\": [\n          \"Alternate Title\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Translated title: Love fāʼidah with the amulet of Prophet Yūsuf\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Contributor\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Falke, ʻUmar, 1893-1962 (Collector)\"\n        ]\n      }\n    },\n    ...\n  ],\n  ...\n}\nUpdate the config/canopy.json file to include these labels in the metadata property.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/collections/59ec43f9-a96c-4314-9b44-9923790b371c?as=iiif&size=100\",\n  \"metadata\": [\"Date\", \"Subject\", \"Contributor\", \"Alternate Title\"],\n  \"search\": {\n    \"enabled\": true,\n    \"flexSearch\": {\n      \"bidirectional\": false,\n      \"charset\": [\"latin:extra\", \"arabic:extra\"],\n      \"document\": {\n        \"index\": [\n          {\n            \"bidirectional\": true,\n            \"depth\": 3,\n            \"field\": \"label\",\n            \"resolution\": 9,\n            \"tokenize\": \"full\"\n          },\n          {\n            \"field\": \"metadata\",\n            \"resolution\": 2\n          },\n          {\n            \"field\": \"summary\",\n            \"resolution\": 1\n          }\n        ]\n      },\n      \"optimize\": true,\n      \"tokenize\": \"strict\"\n    },\n    \"index\": {\n      \"metadata\": {\n        \"all\": false,\n        \"enabled\": true\n      },\n      \"summary\": {\n        \"enabled\": true\n      }\n    }\n  }\n}\nTip: To confirm text is being indexed for search, open the file\n.canopy/index.json and verify your custom data is being added to the index.","validate-search-customizations#Validate search customizations":"Verify your customizations are working by searching for:\nAn Arabic phrase (e.g. \"مجموع الفوائد.\")\nA Manifest summary value (e.g. \"Fāʼidah of Prophet Yūsuf on gaining people's love and respect.\")\nA Manifest metadata value (e.g. \"Falke\", or \"Prophet Yūsuf\")"}},"/deploy-to-github-pages":{"title":"Deploy to GitHub Pages","data":{"":"Canopy IIIF is designed to be deployed as a statically generated website.\nStatic sites are a great option for many projects, as they are fast, secure,\nand easy to deploy and maintain. This guide will walk you through the\nprocess of deploying project as a static website using GitHub Pages using\nthe incorporated GitHub Actions in Canopy to automate the build and\ndeployment process.\nRequires a GitHub account.","use-case#Use Case":"You are a graduate student researching the American painter Beauford Delaney\nand you would like to easily create and host a digital scholarship project\nanalyzing items in your institution's digital collections.","implementation#Implementation":"","create-your-template-repository#Create your template repository":"Navigate to the Canopy IIIF repository\nClick the Use this template dropdown and then select Create a new repository\nUnder Owner, select the GitHub account or organization (if applicable) that you want to own the repository\nEnter a Repository name for your new Canopy IIIF project, ex: delaney-project\nClick the Create repository button","adjust-workflow-permissons#Adjust workflow permissons":"Once the repository is created, open the Settings tab\nOpen the Actions dropdown under Code and automation and select General .\nSelect Read and write permissions option under Workflow permissions and Save. This allows the GitHub\nworkflow to run and the static Canopy output to be deployed to a new branch.","modify-environmmental-variables#Modify environmmental variables":"Next, find the .env file in your repository and open it for editing\nModify NEXT_PUBLIC_URL to reflect your GitHub username, ex: https://markpbaggett.github.io\nModify NEXT_PUBLIC_BASE_PATH to reflect the name of your new repository , ex: /delaney-project\nCommit the changed .env file\nThe .env file should follow a format similar to the following:\nNEXT_PUBLIC_URL=\"https://{GITHUB_USERNAME}.github.io\"\nNEXT_PUBLIC_BASE_PATH=\"/{GITHUB_REPOSITORY_NAME}\"\nIn this example, we are using the GitHub username markpbaggett and the repository name delaney-project.\nNEXT_PUBLIC_URL=\"https://markpbaggett.github.io\"\nNEXT_PUBLIC_BASE_PATH=\"/delaney-project\"\nAfter committing the new .env file, a pre-configured GitHub Actions workflow will run.\nIf you're interested in learning more about the GitHub Actions workflow, you\ncan view the workflow\nfile\nin the Canopy IIIF repository.\nOnce the action has run successfully, the action indicator should update to a check mark and a new branch gh-pages will be created with an output of your static site.","watch-the-build#Watch the build":"Once the gh-pages branch exists, press the Settings tab\nUnder Code and automation, press Pages\nIn the Build and deployment section, select gh-pages from the Branch dropdown\nLeave /(root) set from the Folder dropdown\nClick Save","validate-the-url#Validate the URL":"Tip: Find the URL in the GitHub Settings tab, by viewing Pages\nunder Code and automation.\nNow your Canopy site will be active at a URL derived from values you defined in the NEXT_PUBLIC_URL and NEXT_PUBLIC_BASE_PATH settings.\nhttps://[NEXT_PUBLIC_URL][NEXT_PUBLIC_BASE_PATH]\nThe example values above would result in the following URL:\nhttps://markpbaggett.github.io/delaney-project"}},"/development":{"title":"Development","data":{"environment#Environment":"When you are ready to deploy your site, you will need to modify environment variables to reflect how your site is hosted. The NEXT_PUBLIC_URL variable is used to declare the base URL of your site. This base url is critical to routing of works in Canopy and wiring up canonical links in SEO.","modify-environment-variables#Modify Environment Variables":"NEXT_PUBLIC_URL=\"https://canopy-iiif.github.io\"\nNEXT_PUBLIC_BASE_PATH=\"/canopy-iiif\"\nEdit the .env file at the root of the working directory to reflect your site's production configuration.","root-base-path#Root Base Path":"If your project is hosted at the root of the public URL, NEXT_PUBLIC_BASE_PATH is defined as an empty string.https://exhibit.library.northwestern.edu\nNEXT_PUBLIC_URL=\"https://exhibit.library.northwestern.edu\"\nNEXT_PUBLIC_BASE_PATH=\"\"","github-pages#GitHub Pages":"GitHub Pages is a popular hosting solution for static sites. When hosting on GitHub Pages, you will need to set the NEXT_PUBLIC_BASE_PATH to reflect the repository name.https://markpbaggett.github.io/abolition-now\nNEXT_PUBLIC_URL=\"https://markpbaggett.github.io\"\nNEXT_PUBLIC_BASE_PATH=\"/abolition-now\"","subdirectory-as-base-path#Subdirectory as Base Path":"You may need to host your site in a subdirectory. This follows the same pattern as GitHub Pages, but you will need to set the NEXT_PUBLIC_BASE_PATH to reflect the subdirectory.https://example.org/exhibit\nNEXT_PUBLIC_URL=\"https://example.org\"\nNEXT_PUBLIC_BASE_PATH=\"/exhibit\"","avoid-code-conflicts#Avoid Code Conflicts":"To avoid potential code conflicts on future release updates, it is advised not to update the following integrated Canopy pages in the Next.js pages directory.\nNote: Future considerations will be delivered upon for updating content within these pages."}},"/features":{"title":"Features","data":{"":"On build, Canopy IIIF will generate a static site from a IIIF Collection.","automatic-pages-and-routes#Automatic Pages and Routes":"Canopy IIIF will automatically generate pages and routes for the following:","guides#Guides":"Customize the Search Index","custom-pages#Custom Pages":"Implementers can add custom pages with Markdown content in the their content directory. An about route at content/about is created as a usable example route.For more information regarding creation of new content, see the Content documentation.","guides-1#Guides":"Create Markdown Content\nCreate Navigation Routes"}},"/enable-a-map-with-navPlace":{"title":"Enable a Map with navPlace Properties","data":{"":"Canopy IIIF allows users to explore the underlying collection through an\ninteractive map. When activated, this component displays a map featuring\nmarkers representing each point Feature within the\nnavPlace properties found\nthroughout the Manifests of the overarching collection. This guide will walk\nyou through the process of enabling the Map component in Canopy IIIF.\nThe Map component is populated by Manifests with a navPlace property. For\nmore information, see the IIIF navPlace\nextension specification.","use-case#Use Case":"You are a digital scholar with geospatial point data and you would like to enable\nthe Map component to create additional access points for Manifests in your IIIF Collection.You would like to customize the map component by:\nusing a topographic map as the default tile layer with a street map as an optional additional layer\nusing a custom icon for the markers","implementation#Implementation":"","create-a-new-canopy-iiif-project#Create a new Canopy IIIF Project":"Select a IIIF Collection with geospatial point data and configure a Canopy IIIF project. In this example we will use the William Cox Cochran Photograph IIIF Collection.\n{\n  \"collection\": \"https://digital.lib.utk.edu/assemble/collection/gsmrc/wcc\",\n  \"featured\": [\"https://digital.lib.utk.edu/assemble/manifest/wcc/269\"],\n  \"metadata\": [\"Place\", \"Date\", \"Subject\"]\n}","add-navplace-properties-to-the-manifests-in-your-collection#Add navPlace Properties to the Manifests in your collection":"Currently, Canopy only leverages the navPlace properties found in Manifests\nwith geometry properties of type Point.\nBefore the /map component is enabled, add navPlace properties to Manifests in your source IIIF Collection.\nIn accordance with the specification, include the navPlace extension to the Linked Data Context of each manifest by adding\nhttps://iiif.io/api/extension/navplace/context.json to the @context property before\nhttp://iiif.io/api/presentation/3/context.json.\n\"@context\": [\n  \"https://iiif.io/api/extension/navplace/context.json\",\n  \"http://iiif.io/api/presentation/3/context.json\"\n]\nAdd the navPlace property to each manifest with a FeatureCollection and at least one Feature of type Point.\nEach Feature should include a label property that will be used as the text for the corresponding marker. The\ncoordinates array should include the longitude and latitude coordinates of the Feature with the longitude\nappearing first.\n\"navPlace\": {\n  \"id\": \"https://digital.lib.utk.edu/notdereferenceable/featurecollection//1\",\n  \"type\": \"FeatureCollection\",\n  \"features\": [\n    {\n      \"id\": \"https://digital.lib.utk.edu/notdereferenceable/feature/1\",\n      \"type\": \"Feature\",\n      \"properties\": {\n        \"label\": {\n          \"en\": [\n            \"Summit of Pine Mt. Chilhowee Range Blount Co. Tenn. -- Pine Mountain\"\n          ]\n        }\n      },\n      \"geometry\": {\n        \"type\": \"Point\",\n        \"coordinates\": [\n          -83.91907,\n          35.59647\n        ]\n      }\n    }\n  ]\n}\nFollowing the above step, the Manifest for Summit of Pine Mt. Chilhowee Range Blount Co. Tenn. has the additional context for the navPlace extension and the added navPlace property defined.","enable-the-map-component#Enable the Map Component":"Add the map property to your configuration and update map.enabled to true.\n{\n  \"collection\": \"https://digital.lib.utk.edu/assemble/collection/gsmrc/wcc\",\n  \"featured\": [\"  https://digital.lib.utk.edu/assemble/manifest/wcc/269\"],\n  \"metadata\": [\"Place\", \"Date\", \"Subject\"],\n  \"map\": {\n    \"enabled\": true,\n    \"defaultBounds\": [[51.505, -0.09]],\n    \"icon\": {\n      \"iconUrl\": \"images/marker-icon.png\",\n      \"iconSize\": [24, 36],\n      \"iconAnchor\": [12, 36]\n    },\n    \"tileLayers\": [\n      {\n        \"name\": \"OpenStreetMap\",\n        \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n        \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n      }\n    ]\n  }\n}","modify-tile-layers#Modify Tile Layers":"Modify the map.tileLayers property by adding the OpenTopMap layer to the top of the array.\n{\n  \"collection\": \"https://digital.lib.utk.edu/assemble/collection/gsmrc/wcc\",\n  \"featured\": [\"  https://digital.lib.utk.edu/assemble/manifest/wcc/269\"],\n  \"metadata\": [\"Place\", \"Date\", \"Subject\"],\n  \"map\": {\n    \"enabled\": true,\n    \"defaultBounds\": [[51.505, -0.09]],\n    \"icon\": {\n      \"iconUrl\": \"images/marker-icon.png\",\n      \"iconSize\": [24, 36],\n      \"iconAnchor\": [12, 36]\n    },\n    \"tileLayers\": [\n      {\n        \"name\": \"OpenTopoMap\",\n        \"url\": \"https://{s}.tile.opentopomap.org/{z}/{x}/{y}.png\",\n        \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n      },\n      {\n        \"name\": \"OpenStreetMap\",\n        \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n        \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n      }\n    ]\n  }\n}","modify-the-marker-icon#Modify the Marker Icon":"Replace the map.icon.iconUrl property with the path to your custom icon. This can be a remote resource that is served from\nanother website or a local resource that is served from your public/images directory in Canopy.\nIf the size of your icon is different than the default size of 24px by 36px, modify the map.icon.iconSize.\nSimilarly, if the anchor point of your icon is different than the default anchor point of 12px by 36px, modify\nthe point of the icon which will correspond to marker's location in map.icon.iconAnchor.\n{\n  \"collection\": \"https://digital.lib.utk.edu/assemble/collection/gsmrc/wcc\",\n  \"featured\": [\"  https://digital.lib.utk.edu/assemble/manifest/wcc/269\"],\n  \"metadata\": [\"Place\", \"Date\", \"Subject\"],\n  \"map\": {\n    \"enabled\": true,\n    \"defaultBounds\": [[51.505, -0.09]],\n    \"icon\": {\n      \"iconUrl\": \"https://raw.githubusercontent.com/pointhi/leaflet-color-markers/master/img/marker-icon-violet.png\",\n      \"iconSize\": [24, 36],\n      \"iconAnchor\": [12, 36]\n    },\n    \"tileLayers\": [\n      {\n        \"name\": \"OpenTopoMap\",\n        \"url\": \"https://{s}.tile.opentopomap.org/{z}/{x}/{y}.png\",\n        \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n      },\n      {\n        \"name\": \"OpenStreetMap\",\n        \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n        \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n      }\n    ]\n  }\n}","add-the-map-route-to-your-navigation#Add the Map Route to your Navigation":"Add the map route to your content/_meta.json file so that it appears in the Navigation bar.\n[\n  {\n    \"path\": \"/works\",\n    \"text\": \"Works\"\n  },\n  {\n    \"path\": \"/metadata\",\n    \"text\": \"Metadata\"\n  },\n  {\n    \"path\": \"/map\",\n    \"text\": \"Map\"\n  },\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  }\n]","validate-the-map-customizations#Validate the Map customizations":"In your browser navigate to the /map route to view the Map component.\nEach Manifest with a navPlace property will be represented by a marker on the map.\nTile layers can be toggled from the layer options in the corner of the map."}},"/features/home":{"title":"Home","data":{"":"The Canopy IIIF build process automatically generates a home page for your project at /. This page is customizable from the content/index.mdx file in your collection's repository.\n---\ntitle: Canopy IIIF\nshowHero: true\nshowHighlighted: true\n---\n## About Canopy\n**Canopy IIIF** is a purely [IIIF](https://iiif.io/) sourced site generator using Next.js. Canopy is an experimental application that will standup a browseable and searchable digital collections style site entirely from a [IIIF Collection](https://iiif.io/api/presentation/3.0/#51-collection) and the resources it references.\n<ButtonWrapper>\n  <Button children=\"Read More\" href=\"/about\" buttonType=\"primary\" />\n  <Button\n    children=\"View Code\"\n    href=\"https://github.com/canopy-iiif/canopy-iiif\"\n  />\n</ButtonWrapper>","features#Features":"The Canopy IIIF home page is comprised of the following features:\nHero Image\nCustom Content\nHighlighted Works","hero-image#Hero Image":"If showHero is true, a hero image is created for your collection automatically.\n---\ntitle: Canopy IIIF\nshowHero: true\nshowHighlighted: true\n---\n## About Canopy\nIf a featured property is included in your collection's config/canophy.json file, the hero image will be generated from these manifests.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/search?query=%22nez%20perce%22&as=iiif&size=125\",\n  \"metadata\": [\"Subject\", \"Date\", \"Dimensions\"],\n  \"featured\": [\n    \"https://api.dc.library.northwestern.edu/api/v2/works/cd5e1b9c-370b-40e5-b3d9-defc1d8e0777?as=iiif\",\n    \"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\"\n  ]\n}\nIf the featured array contains more than one Manifest, the hero image will be a slideshow with arrows pointing left\nand right that allows visitors to browse featured works. In the bottom right corner of the hero image, the label of the\nManifest is displayed as the title of the work.If no featured Manifests are provided in config/canopy.json, the hero image will be randomly selected from the\nManifests within the collection.","custom-content#Custom Content":"You can easily add an abstract or other custom content to the home page beneath the hero image by modifying the contents of content/index.mdx.\n---\ntitle: Canopy IIIF\nshowHero: true\nshowHighlighted: true\n---\n## About Canopy\n**Canopy IIIF** is a purely [IIIF](https://iiif.io/) sourced site generator using Next.js. Canopy is an experimental application that will standup a browseable and searchable digital collections style site entirely from a [IIIF Collection](https://iiif.io/api/presentation/3.0/#51-collection) and the resources it references.\n<ButtonWrapper>\n  <Button children=\"Read More\" href=\"/about\" buttonType=\"primary\" />\n  <Button\n    children=\"View Code\"\n    href=\"https://github.com/canopy-iiif/canopy-iiif\"\n  />\n</ButtonWrapper>","highlighted-works#Highlighted Works":"If showHero is set to true, highlighted works sliders are displayed at the bottom of the page.\n---\ntitle: Canopy IIIF\nshowHero: true\nshowHighlighted: true\n---\n## About Canopy\nThese sliders are generated based on the values of the metadata array in config/canopy.json.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/search?query=%22nez%20perce%22&as=iiif&size=125\",\n  \"metadata\": [\"Subject\", \"Date\", \"Dimensions\"],\n  \"featured\": [\n    \"https://api.dc.library.northwestern.edu/api/v2/works/cd5e1b9c-370b-40e5-b3d9-defc1d8e0777?as=iiif\",\n    \"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\"\n  ]\n}\nThe sliders are driven by IIIF Collections that are automatically generated during the build process. At this time,\na IIIF Collection resource is created for each unique metadata value in the Manifests of the IIIF Collection that is\nassociated with a label in the metadata array of config/canopy.json. The generated IIIF Collections contain each\nManifest that has the value for the associated metadata label.On the home, a slider is created for each value in the metadata array of confing/canopy.json. The IIIF Collection\nthat is passed to each slider is randomly selected during build time.\nFor more information on Sliders in Canopy, see Slider and the Create Markdown Content\nguide."}},"/features/metadata":{"title":"Metadata","data":{"":"Canopy IIIF automatically provides a Metadata page at /metadata. This page helps improve the discovery of the works within the collection by displaying a link to searches of all curated subjects from the metadata property in config/canopy.json and their unique values that appear in Manifests across the source Collection.","features#Features":"This page is generated automatically during the build process and is based on the values specified in the metadata\nproperty of the config/canopy.json file.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/search?query=%22nez%20perce%22&as=iiif&size=125\",\n  \"metadata\": [\"Subject\", \"Date\", \"Dimensions\"],\n}\nThe page is organized based on the order of the metadata labels in the array. Below each label is a link to search\nresults to works in the collection that have that metadata label and a unique value. The values are organized in order\nof how many works have that label and value pair in the collection. Clicking the link will take the user to search\nresults limited to that specific label and value pair."}},"/features/search":{"title":"Search and Work Results","data":{"":"Canopy IIIF automatically provides a route to all works in a collection at /works. Each Manifest in the IIIF Collection\nis represented on this page. This same template is displayed when a user searches for a term in the search bar at the\ntop of the screen. This page displays labels and thumbnails for all works in the collection and are lazily loaded as\nthe user scrolls down the page.","features#Features":"The search and work results page is composed of several features that are available automatically:\nResults List\nFilter","results-list#Results List":"The results list is a masonry layout of all works in the collection or the corresponding search results when loaded as\nsearch results or limited via the Filter. Each work is represented by a figure element that is made up of a\nrepresentative thumbnail and the Manifest label. The figures are hyper linked to the corresponding work page. The list\nis lazily loaded as the user scrolls down the page.","filter#Filter":"The Filter element allows a user to limit the results list to a specific set of works. The filter options are determined\nby the values of the metadata property in the config/canopy.json file. From the filter, a user can limit the results\nby one value from each metadata field. Once the user clicks View Results, the results list will be limited to only\nthe works that match the selected filter options."}},"/features/works":{"title":"Works","data":{"":"For each Manifest in your source IIIF Colllection, Canopy automatically generates a unique route that serves as the work page for that item as /works/${slugified-manifest-label}. The contents of the Manifest are parsed and utilized to automatically generate all the features of the work page.\nFor more information about the pattern Canopy uses for converting a label to URL slug, see the slugify npm package.\nIf the label of the Manifest is not unique, Canopy will append a unique identifier to the end of the slug to ensure each work page has a unique route.","features#Features":"The work page is composed of several features that are generated automatically based on the contents of the Manifest:\nIIIF Viewer\nMetadata and Required Statements\nReferenced Content\nRelated Works","iiif-viewer#IIIF Viewer":"At the top of the work page is a IIIF Viewer. Currently, Canopy leverages the Clover IIIF Viewer component to display deep zoomable images, A/V resources, and multi-canvased works. The original IIIF Manifest that the work page is generated from is passed to Clover so that it can display the work accordingly.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/19efac1e-5e79-471c-89c2-a60a775562ce?as=iiif\" />","metadata-and-required-statements#Metadata and Required Statements":"Descriptive properties from the IIIF Manifest are displayed directly underneath the viewer.The label of the Manifest is displayed prominently as the title of the work.\n{\n  ...\n  \"label\": {\n      \"none\": [\n        \"Raven Blanket - Nez Percé\"\n      ]\n    },\n  ...\n}\nIf a summary is present in the Manifest, its values are displayed as the work's description.\n{\n  ...\n  \"summary\": {\n      \"none\": [\n        \"written, illustrated, and published by Edward S. Curtis ; edited by Frederick Webb Hodge ; foreword by Theodore Roosevelt ; field research conducted under the patronage of J. Pierpont Morgan. ; Original photogravures produced in Boston by John Andrew & Son from 1899-1910.\"\n      ]\n  },\n  ...\n}\nNext, each JSON object in the metadata and requiredStatement properties of the Manifest are displayed in a list of definitions.\nIf the metadata label is listed in the metadata property inside the canopy.json file, the value will link to search\nresults of all other works within the collection that also contain the subject and unique value.\n{\n  ...\n  \"metadata\": [\n    {\n      \"label\": {\n        \"none\": [\n          \"Alternate Title\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Portfolio 8. The Nez Perces. Wallawalla. Umatilla. Cayuse. The Chinookan tribes\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Contributor\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Curtis, Edward S., 1868-1952 (Author)\",\n          \"Curtis, Edward S., 1868-1952 (Illustrator)\",\n          \"Curtis, Edward S., 1868-1952 (Publisher)\",\n          \"Hodge, Frederick Webb, 1864-1956 (Editor)\",\n          \"Roosevelt, Theodore, 1858-1919 (Author of introduction, etc.)\",\n          \"Morgan, J. Pierpont (John Pierpont), 1837-1913 (Patron)\",\n          \"John Andrew & Son (Printmaker)\",\n          \"Plimpton Press (Publisher)\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Cultural Context\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Content on this site is drawn from a historical source which includes materials that may contain offensive images or language reflecting the nature of Settler Colonialism in America. Such materials should be viewed in the context of the time and place in which they were created. The images and text in this site are presented as specific, original artifacts recording the attitudes, perspectives and beliefs of a different era. Northwestern University does not endorse the views expressed in this collection which may contain images and text offensive to some researchers.\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Date\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"1910\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Department\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Charles Deering McCormick Library of Special Collections\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Dimensions\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"46 x 32 cm [plate size]\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Genre\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"photomechanical prints\",\n          \"photogravures (prints)\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Last Modified\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"2023-04-24T19:18:51.891873Z\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Language\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"English\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Location\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Washington (State)--Seattle\",\n          \"Massachusetts--Norwood\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Materials\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"1 photogravure : brown ink\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Rights Statement\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"No Copyright - United States\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Series\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Edward S. Curtis's The North American Indian--Portfolio 8. The Nez Perces. Wallawalla. Umatilla. Cayuse. The Chinookan tribes\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Source\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"The North American Indian (1907-1930) v.08, The Nez Perces. Wallawalla. Umatilla. Cayuse. The Chinookan tribes ([Seattle] : E.S. Curtis ; [Cambridge, Mass. : The University Press], 1911), plate no. 259\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Subject\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"Nez Percé Indians\",\n          \"Walla Walla Indians\",\n          \"Umatilla Indians\",\n          \"Cayuse Indians\",\n          \"Chinookan Indians\",\n          \"Tlakluit Indians\"\n        ]\n      }\n    },\n    {\n      \"label\": {\n        \"none\": [\n          \"Technique\"\n        ]\n      },\n      \"value\": {\n        \"none\": [\n          \"photomechanical processes\",\n          \"photogravure (process)\"\n        ]\n      }\n    }\n  ],\n  ...\n}\nFinally, a link to the IIIF Manifest is displayed so that the item can be easily reused.","referenced-content#Referenced Content":"If the Manifest has been included in a referencedManifests section of any custom content page, a link to the custom\ncontent will be generated and displayed in the Content Referencing This Work section.\n---\ntitle: \"January 1955 Correspondence\"\nnavigation: \"correspondence\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/46de2c91-3a29-4525-939e-ee17073f3a7e?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/bb968afb-7857-46bd-9392-d8617a93cc9f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/14b8212b-7c49-431b-ad04-e4cd5cce6416?as=iiif\n---\nTo learn more about referencing manifests in custom content pages, see the\nCreate Markdown Content guide.","related-works#Related Works":"Finally, the Related Works sections is displayed. This section is generated automatically by Canopy and is based on the\ncontents of the metadata property in canopy.json. For each label, Canopy creates a Slider\ncomponent based on a random value associated with it in the Manifest's metadata property. This label\nand value has a corresponding IIIF Collection Manifest that is generated during the build process that includes all\nmanifests in the collection that have the same label and value.\n<Slider iiifContent=\"/api/facet/creator/david-alfaro-siqueiros \" />\nTo learn more about reusing automatically generated collections like this in custom content pages, see the\nLeveraging Metadata Collections guide."}},"/get-started":{"title":"Create a Canopy Project","data":{"":"Have a project in mind? Let's get started! This guide will walk you through\nthe process of creating a basic Canopy IIIF project using a readily provided\nIIIF Collection.","use-case#Use Case":"You are on a team at a university library seeking to create a digital exhibit for a Korean Literary\ncollection in your digital repository that is provided as a IIIF Collection. You want to create\na discovery focused web site that allows users to search and browse the collection.","implementation#Implementation":"","create-a-project#Create a project":"","using-a-github-template#Using a Github template":"This method requires a GitHub account; however, it\nshould be easier to follow for users of Canopy without a developer\nenvironment.\nNavigate to the Canopy IIIF repository in GitHub\nClick the \"Use this template\" button\nClick the \"Create a new repository\" button\nSelect the account you want to own the repository\nEnter a repository name and optional description\nClick the \"Create repository\" button","using-git-clone#Using git clone":"In your terminal, navigate to the a working directory where you want to create your project\nClone the canopy-iiif/canopy-iiif repository OR your Canopy repository instance\ncd ~/Projects\ngit clone git@github.com:canopy-iiif/canopy-iiif.git","install-dependencies#Install dependencies":"Navigate to your new project directory and install dependencies.\ncd canopy-iiif\nnpm install","create-configuration-file#Create configuration file":"Copy the sample configuration file and update collection, featured, and metadata properties.\ncp config/canopy.sample.json config/canopy.json\nIn this example we will use the Korean Literary Collection IIIF Collection URL provided by University of Washington Libraries.\ncollection is the IIIF Collection URI to be used as the root of your Canopy IIIF site\nfeatured array is a list of Manifest URIs that will be promoted thoughout your Canopy IIIF site\nmetadata array is a list of metadata labels that match string values in your Manifest URI metadata entries to be used for discovery purposes\nSee Configuration for detailed documentation.\n{\n  \"collection\": \"https://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\",\n  \"featured\": [\n    \"https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json\"\n  ],\n  \"metadata\": [\"Author\", \"Place of Publication\"]\n}","ready-to-go#Ready to go!":"If you are using GitHub, you can skip this step and run Canopy without a\ndeveloper environment directly using GitHub Pages.\nNow that you have a project and configuration set, you can run Canopy IIIF.\nnpm run dev","build-process#Build process":"The build process may take a few minutes depending on the size of your IIIF Collection and provider response times. A Collection of ~100 items should build in 30 seconds or less.\nBuilding - Canopy retrieves the source IIIF Collection\nCreate Manifest listing - Canopy retrives all IIIF Manifests in the Collection\nCreate facets as IIIF Collections - Canopy anaylzes the Manifests and creates IIIF Collections for each unique metadata label and value\nBuild search entries - Canopy is creates search entries for each Manifest from descriptive metadta\nReady 🚀 - Canopy is ready to go!\nBuilding Canopy from IIIF Collection...\nhttps://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\nCreating Manifest listing...\nAggregating 135 Manifest(s) in 14 chunk(s)...\nChunk (1/14)\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:560/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1494/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:678/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:983/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:314/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1105/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:498/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:839/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1363/manifest.json ➜ 200\n## build continues...\nChunk (14/14)\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28181/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:27749/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28140/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28280/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:27976/manifest.json ➜ 200\n135/135 Manifests(s) retrieved successfully.\nCreating facets as IIIF Collections...\n↓ /api/facet/author/unidentified.json\n↓ /api/facet/author/kim-tong-in.json\n↓ /api/facet/author/chng-chi-yong-chong-chi-yong.json\n↓ /api/facet/author/yi-tae-jun.json\n↓ /api/facet/author/an-hoe-nam.json\n↓ /api/facet/author/im-hak-su.json\n## build continues...\nBuilding search entries...\n...Ready 🚀\n▲ Next.js 13.5.4\n- Local:        http://localhost:5001\n- Environments: .env","browse-your-site#Browse your site":"In your browser, navigate to http://localhost:5001 to view your Canopy IIIF site.","home-page#Home page":"Content on the home page is geared towards discovery of your IIIF Collection. The home page will render a hero component for featured Manifests and a slider components for defined metadata labels and their most common values.","search-page#Search page":"All Manifests in your IIIF Collection are now represented as results at the /search route. In addition to full text search, results are filterable by defined metadata labels and available values. In the example Korean Literary Collection, there are 135 items available for search. A query for poems returns 43 results.","work-page#Work page":"All Manifests in your IIIF Collection are now available as statically generated pages with a /work/slug-generated-from-label pattern. Each work represents a single Manifest, its descriptive metadata, and various other IIIF properties. Clover IIIF is the defacto deep-zoom and A/V capable viewer in Canopy IIIF but other IIIF viewers can be easily configured.","try-alternate-iiif-collections#Try Alternate IIIF Collections":"A great way to visualize the agility of Canopy IIIF is to experiment with alternate IIIF Collections. Try copying one or all of the following config/canopy.json configurations to your project and re-running the build process.","commedia-dellarte#Commedia dell'Arte":"View Collection\nProvided by Northwestern University\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/search?query=collection.id:%22c373ecd2-2c45-45f2-9f9e-52dc244870bd%22&as=iiif\",\n  \"featured\": [\n    \"https://api.dc.library.northwestern.edu/api/v2/works/a037a4fb-add4-40af-8add-9a02e5573471?as=iiif\"\n  ],\n  \"metadata\": [\"Subject\", \"Date\"]\n}","calahan-family-postcards#Calahan Family Postcards":"View Collection\nProvided by the University of Tennessee\n{\n  \"collection\": \"https://digital.lib.utk.edu/assemble/collection/collections/calahan\",\n  \"featured\": [\"https://digital.lib.utk.edu/assemble/manifest/calahan/10\"],\n  \"metadata\": [\"Description\", \"Subject\"]\n}","pacific-northwest-sheet-music-collection#Pacific Northwest Sheet Music Collection":"View Collection\nProvided by the University of Washington\n{\n  \"collection\": \"https://cdm16786.contentdm.oclc.org/iiif/2/sm/manifest.json\",\n  \"featured\": [\n    \"https://cdm16786.contentdm.oclc.org/iiif/2/sm:49/manifest.json\"\n  ],\n  \"metadata\": [\"Composer\", \"Genre\", \"Date of Publication\"]\n}"}},"/guides":{"title":"User Guides","data":{"":"To get started with Canopy IIIF, check out the following guides that provide step-by-step instructions."}},"/":{"title":"Canopy  IIIF","data":{"":"{\n  \"@context\": \"http://iiif.io/api/presentation/3/context.json\",\n  \"id\": \"https://collections.britishart.yale.edu/iiif/collection/paintings_of_francis_danby\",\n  \"type\": \"Collection\",\n  \"label\": {\n    \"en\": [\"Paintings of Francis Danby\"]\n  },\n  \"items\": [\n    {\n      \"id\": \"https://manifests.collections.yale.edu/ycba/obj/116\",\n      \"type\": \"Manifest\",\n      \"label\": {\n        \"en\": [\"The Mountain Torrent\"]\n      }\n    },\n    {\n      \"id\": \"https://manifests.collections.yale.edu/ycba/obj/38658\",\n      \"type\": \"Manifest\",\n      \"label\": {\n        \"en\": [\"A View across the Artist's Garden from his House at Exmouth, Devonshire\"]\n      }\n    },\n    {\n      \"id\": \"https://manifests.collections.yale.edu/ycba/obj/710\",\n      \"type\": \"Manifest\",\n      \"label\": {\n        \"en\": [\"Shipwreck\"]\n      },\n    },\n  ]\n}\nWhat is Canopy IIIF?\nCanopy is an open source site generator built with\nIIIF and Next.js. Using a IIIF\nCollection as a data\nsource, Canopy IIIF generates a browseable and searchable static site and\nprovides a straightforward solution using Markdown for adding scholary context\nto the resources that are referenced.\nFeatures\neasy Markdown authoring for scholarly content\nstatic page generation for Manifests in a Collection\ncustomizable full-text search using FlexSearch\nautomatic facets for Manifest metadata\nreusable components based on IIIF content\ninteractive maps using the navPlace Extension\nUse Cases\nCanopy “makes easy” the creation of digital exhibits for libraries, archives, and museums by providing user-experience focused components that bring IIIF resources to life. For digital humanists and scholars, Canopy provides a straightforward method to curate works from multiple sources and provide additional perspectives and aboutness beyond the included descriptive metadata. The decentralized, interoperable, and linked-data attributes of the IIIF APIs empower Canopy to provide smaller institutions with a streamlined front-end platform, neatly sidestepping the monolithic complexities often associated with conventional digital asset management systems.\nDigital Scholarship\nCurate and aggregate content from multiple providers and add context to\nIIIF resources\nDigital Exhibits\nEasily create digital exhibits from IIIF Collections and Manifests\nDigital Collections\nDevelop a decoupled user interface for small-scale digital collections"}},"/stackblitz-playground":{"title":"StackBlitz Playground","data":{"":"Want to quickly try out Canopy? Click the button below to open a\nStackBlitz playground.","use-case#Use Case":"You are seeking to quickly try out or demonstrate Canopy IIIF and do not want to install it locally or be concerned with a developer environment.","implementation#Implementation":"","create-a-stackblitz-instance#Create a StackBlitz instance":"Click on the button above, \"Open in StackBlitz\". This will open a new browser tab and load the Canopy project in StackBlitz.\nThere may be CORS issues rendering images in Safari and Firefox browsers. If\nyou're experiencing broken images, please try Chrome or Brave browsers.","customize-canopy-collection#Customize Canopy Collection":"If you'd like to jump right into customizing or tinkering with config settings, re-name /config/canopy.sample.json to /config/canopy.json. This will override default config settings and point Canopy to your custom values.\nYou may experience StackBlitz resource limits experimenting with larger\nCollections. Prefer small-ish Collections where possible in this environment.\nWe'll use an example Late 19th Century Bicycle Parts Catlog\nCollection, provided as a IIIF Collection.\nCreate a file named config/canopy.json.\nCopy the below configuration into the file.\nSave the configuration file.\n{\n  \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/search?query=collection.id:%22cd92fb8d-76a7-4e72-be0f-78a5839caa89%22&as=iiif\",\n  \"featured\": [\n    \"https://api.dc.library.northwestern.edu/api/v2/works/0142e6bc-21f6-4590-94fb-d35f00b45342?as=iiif\"\n  ],\n  \"metadata\": [\"Date\", \"Subject\", \"Notes\"]\n}\nTo view config/canopy.json changes, you'll need to re-build the app. Near the bottom of your StackBlitz screen, you'll see a Terminal window.\nClick into the StackBlitz Terminal\nQuit the dev server ctrl + c.\nRe-start the dev server npm run dev.","customize-other-options#Customize Other Options":"You now have a starting point to customize other options. For example, you can now experiment further with the Customize the Search Index guide."}},"/use-metadata-collections":{"title":"Use Metadata Collections","data":{"":"Canopy generates new IIIF Collections based on the\nmetadata labels included in your\nconfig/canopy.json file. For each unique string value associated with the\nlabel across IIIF Manifests found in your project, a new IIIF Collection is\ncreated. These Collections are used to create facets across your site and\nare also available for reuse in custom content.\nThis guide assumes you have a Canopy IIIF project. See the Create a\nProject guide to get started.","use-case#Use Case":"You are a researcher creating a digital scholarship project and would like to add a custom content page\nwith a Slider component that displays all the works in your collection that have a \"Subject\" of \"War pensions\".\n  \"metadata\": [\n    {\n      \"label\": {\n        \"en\": [\n          \"Subject\"\n        ]\n      },\n      \"value\": {\n        \"en\": [\n          \"War pensions\",\n          \"Tennessee--Politics and government--To 1865\"\n        ]\n      }\n    }\n  ]","implementation#Implementation":"","add-metadata-labels-to-the-metadata-property-of-your-config#Add Metadata Labels to the metadata Property of your Config":"In order for Canopy to generate a Collection for a given metadata label, you must add the label to the\nmetadata property in your config/canopy.json file. The metadata property is an array of metadata labels that\nmatch string values in your Manifest URI metadata entries.Since you need a Collection for the Subject label with value of \"War pensions\", you need to add the label to your\nmetadata array if it's not already there.\n{\n  \"collection\": \"https://digital.lib.utk.edu/assemble/collection/collections/tdh\",\n  \"metadata\": [\"Subject\", \"Place\", \"Format\", \"Date\"]\n}","validate-that-the-collection-was-generated#Validate that the Collection was Generated":"If you have defined NEXT_PUBLIC_BASE_PATH in your .env file, you will need\nto include that pattern in your URI.\nIIIF Collections are generated when your site is rebuilt or when your server is restarted. After you've added the\nmetadata label to your config/canopy.json file, you should make sure your collection exists. If you are working\ndirectly in GitHub with GitHub Pages, you can commit the change and wait for the site to rebuild. If you are working\nlocally, you will need to stop your local server:ctrl + c and then npm run dev to restart your local server.Once your site is running, you can check that the IIIF Collection was generated by visiting the Collection URI in your\nbrowser. Canopy uses the slugify package when generating IIIF Collections. In\nthis process, both the metadata label and metadata value are slugified to create the route to you collection. Slugifying\nis beneficial for search engine optimization and readability.The pattern for the URI for your Collection will be your site's base path followed by /api/facet/${facet.slug}/${value.slug}.json.\nIn this example, the Collection URI would be /api/facet/subject/war-pensions.json.","add-the-collection-to-your-custom-content#Add the Collection to your Custom Content":"Now that you have confirmed the generated Collection is available, you can add it to your custom content. Let's say\nyou want to use the Collection in a Slider component on a custom content page called history in the about section\nof your site. You would create or modify the file according to the Create Markdown Content Guide\nand add the Slider component where you want it to appear on the page with your Collection URI as the value of the\niiifContent attribute.\n---\ntitle: History\nnavigation: \"about\"\n---\n# War Pensions\nDuring the American Civil War, the issue of war pensions emerged as a crucial aspect of post-conflict reconstruction. As\nthe nation grappled with the devastating aftermath of the war, the U.S. government recognized the need to support the\nveterans who had sacrificed their well-being for the Union or the Confederacy. War pensions, providing financial\nassistance and support to disabled veterans, widows, and orphans, became a cornerstone of the post-war social contract.\nThe Pension Acts of 1862 and 1864 marked significant legislative milestones, establishing the framework for compensating\nsoldiers and their families for injuries, disabilities, and loss of life incurred during the conflict. These early\npension initiatives laid the foundation for the more comprehensive pension system that would evolve in subsequent\ndecades, reflecting the government's commitment to honoring and caring for those who bore the burdens of the Civil War.\n## Explore Works Related to War Pensions\n<Slider iiifContent=\"/api/facet/subject/war-pensions.json\" />\nRead more about creating custom content in the Create Markdown Content\nGuide."}},"/configuration/theme":{"title":"Theme","data":{"":"Implementers may choose to modify the theme settings of their Canopy IIIF project.As of v0.12.0, Canopy now utilizes Radix UI Themes, allowing implementers to customize Colors, Scaling, and Radius styling.Users may also set the default \"mode\" as defaultTheme, options include light, dark, or system. The Toggle Theme button can also be enabled or disabled.Note: Theme settings are stored in the users local browser storage. Setting the theme will only affect new users to your site. It will not change the default theme for users who have already visited.","properties#Properties":"The theme property can be customized in the config/canopy.json file.\nProperty\tType\tDescription\taccentColor\tsee Accent Colors\tSets accent color\tgrayColor\tsee Gray Colors\tSets gray color\tpanelBackground\tsolid, translucent\tSets panel component behavior\tradius\tsee Radius\tSets component border radius\tscaling\t90%, 95%, 100%, 105%, 110%\tScales component size\tdefaultTheme\tenum\tSets the default theme for users.\ttoggleEnabled\tboolean\tEnables or disables the Toggle Theme button in the footer.","defaulttheme#defaultTheme":"Sets the default theme for users. The default value is light.\n\"defaultTheme\": \"light\" // \"light\" | \"dark\" | \"system\"","toggleenabled#toggleEnabled":"Boolean value that enables or disables the Toggle Theme button in the footer. The default value is true.\n\"toggleEnabled\": true","example-theme-configuration#Example Theme Configuration":"Example of the theme configuration in config/canopy.json file with a defaultTheme of light and the toggleEnabled set to false.\n{\n  \"collection\": \"https://iiif.bodleian.ox.ac.uk/iiif/collection/hobhouse\",\n  \"theme\": {\n    \"defaultTheme\": \"light\",\n    \"accentColor\": \"red\",\n    \"grayColor\": \"mauve\",\n    \"radius\": \"small\",\n    \"scaling\": \"100%\"\n  }\n}"}}}