{"/about":{"title":"About","data":{"":"The project name \"Canopy\" is inspired by the tree motiff in the presentation, A Tree's Strength Is Its Trunk: IIIF as Central Operational Infrastructure, delivered by María Matienzo (formerly Stanford University Libraries) and Esmé Cowles (Princeton University Library) at the CNI Fall 2020 Virtual Membership Meeting. Following this infrastructure vision, Canopy was created as a front end solution for rapid and easy creation of static sites using a IIIF Collection and its Manifests.Canopy IIIF is created using Next.js 13, with a FlexSearch index for text search, IIIF Presentation API 3.0 delivering resource content, Radix UI and Stitches used throughout for the user interface, and various community modules from IIIF Commons and Samvera supporting the work presentation and resource delivery.","origination#Origination":"Canopy was initially conceived at the University of Tennessee Libraries in the Summer '21 as a statically generated web application for the Rising from the Ashes: The Chimney Tops 2 Wildfires Oral History Project. This project was generated from a single IIIF Collection; however, the components delivering the user interface became heavily tailored to the source material of the Rising from the Ashes project, thus limiting the reuse of the codebase for other collections. The original Canopy featured a heavily integrated IIIF A/V Viewer designed to deliver Sound and Video resources. This A/V viewer would eventually evolve into a partial inspiration for Clover IIIF.Canopy was reimagined as Canopy IIIF in early Winter '22 with the primary focus of the project maintaining the the ability to build an interoperable site from any IIIF Collection following IIIF Presentation API 2.0 and 3.0 specifications.","contributors#Contributors":"Creators\nMat Jordan - Northwestern University\nLibraries, formerly University of Tennessee Libraries\nMark Baggett - University of Tennessee\nLibraries\nAdam Arling - Northwestern University\nLibraries\nAdditional Credits\nEmily Gore - University of Georgia Libraries, formerly University of Tennessee\nLibraries\nDavid Schober - Northwestern University Libraries\nMartim Passos - Instituto Moreira Salles\nTarje Lavik - University of Bergen Library"}},"/configuration":{"title":"Configuration","data":{"":"The Canopy IIIF build process will read from a custom configuration file at config/canopy.json if it exists. If this configuration file does not exist, the default configuration config/.default/canopy.default.json will be used as a fallback for demonstration purposes.\nSee the Create a Project guide for a step-by-step guide\nillustrating the setup of Canopy IIIF project.","configuration-options#Configuration Options":"Canopy IIIF is a highly configurable application that can be tailored to the needs of a project. Canopy configurations fallback to default options if not customized.","basic-configuration#Basic Configuration":"A custom Canopy configuration file can be created with the following steps:\nFind your config/ directory\nCopy canopy.sample.json to canopy.json\nMake updates to both the prod and dev configurations","properties#Properties":"Property\tType\tDescription\tcollection\tstring\tIIIF Collection URI\tlabel\tlabel \tIIIF Presentation 3.0 label property\tsummary\tsummary\tIIIF Presentation 3.0 summary property\tfeatured\tArray<string>\tArray of IIIF Manifest URIs\tmetadata\tArray<string>\tArray of metadata labels","collection#collection":"The collection property is required and must be the id of the referenced source IIIF Collection manifest. Collections referencing other Collections in their items property are not currently supported.\n\"collection\": \"https://iiif.bodleian.ox.ac.uk/iiif/collection/hobhouse\"","label-and-summary#label and summary":"The Canopy IIIF site title and description are respectively the label and summary IIIF Presentation API properties of the set IIIF Collection resource. You can optionally override this by providing a valid Presentation 3.0 label and/or summary property. These values are transformed to meta elements in the <head> of the HTML document.\n\"label\": { \"none\": [\"Hobhouse\"] },\n\"summary\": { \"none\": [\"Manuscripts from the archive of Emily Hobhouse.\"] }","featured#featured":"You can inform Canopy IIIF of featured Manifests by providing an array of ids. These must be within the referenced collection resource and the Manifest URIs must be an exact match. These Manifests will render throughout the interface in featured components.Warning: In the current pre-release, featured Manifests must have an Image body on the first Canvas.\n\"featured\": [\n  \"https://iiif.bodleian.ox.ac.uk/iiif/manifest/8da97e8c-4e12-457d-aad8-3327b3aec183.json\",\n  \"https://iiif.bodleian.ox.ac.uk/iiif/manifest/2968d5c7-3718-44ef-92ea-ee4cc58cc677.json\"\n]","metadata#metadata":"Curating Metadata allows implementers of Canopy IIIF to select metadata fields that provide additional access points to end users. The fields can be specified by listing the labels of each metadata property found in the metadata property of the manifest. Metadata labels that are curated will be automatically included as featured elements on the homepage, the metadata page, linking from works, and as facets on the search page. An optimal case is a label common to all or most manifests with some in diversity of values across those resources.Note: Metadata labels are not yet BCP 47 language code aware; however, aggregation processes will make exact string comparisons regardless of language code.\n\"metadata\": [\"Extent\", \"Title\", \"Date Statement\", \"Language\"]","production-and-development#Production and Development":"Both the prod and dev environments have a configuration. These configurations can match each other; however in some cases, development speed can be aided by targeting a smaller IIIF Collection id as a fixture.","example-configuration#Example Configuration":"The following is an example configuration for the Bodleian Libraries' Emily Hobhouse collection. Two Manifests are featured and four metadata labels are curated.\n{\n  \"prod\": {\n    \"label\": { \"none\": [\"Hobhouse\"] },\n    \"summary\": { \"none\": [\"Manuscripts from the archive of Emily Hobhouse.\"] },\n    \"collection\": \"https://iiif.bodleian.ox.ac.uk/iiif/collection/hobhouse\",\n    \"featured\": [\n      \"https://iiif.bodleian.ox.ac.uk/iiif/manifest/8da97e8c-4e12-457d-aad8-3327b3aec183.json\",\n      \"https://iiif.bodleian.ox.ac.uk/iiif/manifest/2968d5c7-3718-44ef-92ea-ee4cc58cc677.json\"\n    ],\n    \"metadata\": [\"Extent\", \"Title\", \"Date Statement\", \"Language\"]\n  },\n  \"dev\": {\n    \"label\": { \"none\": [\"Hobhouse\"] },\n    \"summary\": { \"none\": [\"Manuscripts from the archive of Emily Hobhouse.\"] },\n    \"collection\": \"https://iiif.bodleian.ox.ac.uk/iiif/collection/hobhouse\",\n    \"featured\": [\n      \"https://iiif.bodleian.ox.ac.uk/iiif/manifest/8da97e8c-4e12-457d-aad8-3327b3aec183.json\",\n      \"https://iiif.bodleian.ox.ac.uk/iiif/manifest/2968d5c7-3718-44ef-92ea-ee4cc58cc677.json\"\n    ],\n    \"metadata\": [\"Extent\", \"Title\", \"Date Statement\", \"Language\"]\n  }\n}"}},"/configuration/locale":{"title":"Locale Preferences","data":{"":"Canopy IIIF supports locale preferences for user interface language.","properties#Properties":"For each Locale, the following properties are required:\nProperty\tType\tDescription\tconfig\tstring\tPath to the locale configuration file.\tlabel\tstring\tLabel for the locale.\tlang\tstring\tBCP 47 language code for the locale.\t\n\"locales\": [\n  {\n    \"config\": \"locales/en.json\",\n    \"label\": \"English\",\n    \"lang\": \"en\"\n  }\n]","customizing-a-locale#Customizing a Locale":"User interface language strings are set through a locale configuration file located in the config/locales directory. Persons customizing a Canopy instance can add new language configurations to support their preferred locales. We welcome all pull requests to add new locales to the Canopy IIIF project.English configuration is predefined and found at config/locales/en.json\n{\n  \"footerSourceCollection\": \"Source Collection\",\n  \"footerToggleTheme\": \"Toggle Theme\",\n  \"homepageHighlightedWorks\": \"Highlighted Works\",\n  \"searchButton\": \"Search\",\n  \"searchResults\": \"Results\",\n  \"searchFilter\": \"Filter\",\n  \"searchFilterAny\": \"Any\",\n  \"searchFilterClear\": \"Clear All\",\n  \"searchFilterClose\": \"Close\",\n  \"searchFilterSubmit\": \"View Results\"\n}","multiple-locales#Multiple Locales":"If more than one locale is defined in the config/options.json, a select element will render in the header allowing users to toggle the defined languages. In addition, Canopy will attempt to align the language set by the user's browser with the available options. As a fallback, the first locale defined in the array will be set.As an example, if a visitor with en-US visited a Canopy instance that included both no and en as language options, the en locale configuration would be the default locale. Whereas, if a user visited this same instance with fr as their browser language, the default locale would be the no configuration.\n\"locales\": [\n  {\n    \"config\": \"locales/no.json\",\n    \"label\": \"Norsk\",\n    \"lang\": \"no\"\n  },\n  {\n    \"config\": \"locales/en.json\",\n    \"label\": \"English\",\n    \"lang\": \"en\"\n  }\n]"}},"/configuration/map":{"title":"Map","data":{"":"A map route can be enabled to provide geographic discovery of works via config/options.json. This feature builds markers off of geographic point features found in navPlace properties at the Manifest level. For implementation, Canopy IIIF uses Leaflet to render the map.Note: Currently, only navPlace properties found at the Manifest level are displayed. Also, only Features of type Point are displayed.\nSee the Enable a Map with navPlace for a\nstep-by-step guide.","properties#Properties":"Property\tType\tDescription\tenabled\tboolean\tBoolean value to enable or disable the /map route. The default value is false.\tdefaultBounds\tArray\tThe defaultBounds property defines the coordinates of the initial view of the map.\ticon\tObject\tThe icon property defines the icon used to represent each marker on the map.\ttileLayers\tArray\tThe map's tile layers are also configured here, giving users the ability to choose and customize layers for their project.","enabled#enabled":"Boolean value to enable or disable the /map route. The default value is false. To enable this option, set the option to true.\n\"enabled\": true","defaultbounds#defaultBounds":"The defaultBounds property defines the coordinates of the initial view of the map. This property is an array of\narrays of longitude and latitude coordinates. Unless there are no markers found within the manifests of the\noverarching collection, this property will be ignored.\n\"defaultBounds\": [[51.505, -0.09]]","icon#icon":"The icon property defines the icon used to represent each marker on the map. The iconUrl property is the path to\nthe image file used as the icon. The iconSize property is an array of the width and height of the icon in pixels.\nThe iconAnchor property is an array of the x and y coordinates of the icon's anchor point in pixels. These values\nare used to position the icon relative to its marker's coordinates.\n\"icon\": {\n  \"iconUrl\": \"images/marker-icon.png\",\n  \"iconSize\": [24, 36],\n  \"iconAnchor\": [12, 36]\n}","tilelayers#tileLayers":"The map's tile layers are also configured here, giving users the ability to choose and customize layers for their project. Additional services, such as MapBox, can be easily integrated following this pattern. Each tile layer defined here will appear as an option in the layer control of the map. The name property defines the text next to the radio button. The url property is the link to the tile layer. Finally, the attribution property defines the text that appears at the bottom of the map in case the tile layer requires any specific attribution on use. The first tile layer in the array will be used as the default map.\n\"tileLayers\": [\n  {\n    \"name\": \"OpenStreetMap\",\n    \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n    \"attribution\": \"&copy; OpenStreetMap contributors\"\n  },\n  {\n    \"name\": \"OpenTopoMap\",\n    \"url\": \"https://{s}.tile.opentopomap.org/{z}/{x}/{y}.png\",\n    \"attribution\": \"&copy; OpenStreetMap contributors\"\n  }\n]","example-map-configuration#Example Map Configuration":"Example of the map configuration in config/options.json file with a map enabled:\n{\n  \"map\": {\n    \"defaultBounds\": [[51.505, -0.09]],\n    \"enabled\": true,\n    \"icon\": {\n      \"iconUrl\": \"images/marker-icon.png\",\n      \"iconSize\": [24, 36],\n      \"iconAnchor\": [12, 36]\n    },\n    \"tileLayers\": [\n      {\n        \"name\": \"OpenStreetMap\",\n        \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n        \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n      }\n    ]\n  }\n}"}},"/configuration/search":{"title":"Search","data":{"":"Canopy IIIF utilizes FlexSearch for fast in-memory indexing and provides options for users to customize their search experience. By default Canopy will index Manifest all label and any defined metadata properties. Users can optionally index the summary property.\nSee the Customize the Search Index for a\nstep-by-step guide.","properties#Properties":"Property\tType\tDescription\tenabled\tboolean\tWhether or not to enable search.\tflexSearch\tObject\tFlexSearch configuration options.\tindex\tObject\tIndexing option for Manifests.","enabled#enabled":"Boolean value to enable or disable search indexing. Default is true.\n\"enabled\": true","flexsearch#flexSearch":"Users can customize their FlexSearch configuration using search.flexSearch to fit around the source Collection and its Manifest label, metadata, and summary properties. Customizations range from defining language-specific options such as charset and stemmer, as well as scoring options like resolution and depth.\n\"flexSearch\": {\n    \"charset\": \"latin:extra\",\n    \"optimize\": true,\n    \"tokenize\": \"strict\",\n    \"bidirectional\": false,\n    \"document\": {\n      \"index\": [\n        {\n          \"field\": \"label\",\n          \"tokenize\": \"full\",\n          \"resolution\": 9,\n          \"depth\": 3,\n          \"bidirectional\": true\n        },\n        {\n          \"field\": \"metadata\",\n          \"resolution\": 2\n        },\n        {\n          \"field\": \"summary\",\n          \"resolution\": 1\n        }\n      ]\n    }\n  }","index#index":"Implementers can define the properties of their manifests that are indexed. Canopy IIIF indexes the label property on the Manifest by default. Users can also index the metadata and summary properties.The metadata property is indexed by default for configured metadata labels. Furthermore, all metadata values may be indexed OR you may specify only the properties that are specified in config/canopy.json by modifying search.index.metadata.all.The summary property is not indexed by default. To enable indexing of the summary property, set search.index.summary.enabled to true.\n\"index\": {\n  \"metadata\": {\n    \"enabled\": true,\n    \"all\": false\n  },\n  \"summary\": {\n    \"enabled\": false\n  }\n}","default-search-configuration#Default Search Configuration":"\"search\": {\n  \"enabled\": true,\n  \"flexSearch\": {\n    \"charset\": \"latin:extra\",\n    \"optimize\": true,\n    \"tokenize\": \"strict\",\n    \"bidirectional\": false,\n    \"document\": {\n      \"index\": [\n        {\n          \"field\": \"label\",\n          \"tokenize\": \"full\",\n          \"resolution\": 9,\n          \"depth\": 3,\n          \"bidirectional\": true\n        },\n        {\n          \"field\": \"metadata\",\n          \"resolution\": 2\n        },\n        {\n          \"field\": \"summary\",\n          \"resolution\": 1\n        }\n      ]\n    }\n  },\n  \"index\": {\n    \"metadata\": {\n      \"enabled\": true,\n      \"all\": false\n     },\n    \"summary\": {\n      \"enabled\": false\n     }\n  }\n}"}},"/content":{"title":"Content","data":{"":"Canopy allows for easy creation of contextual content to support and reference the automatically generated content in a IIIF Collection. For the purpose of easy content generation Canopy utilizes MDX which \"allows you to use JSX in your markdown content.\"\nSee the Creating Markdown Content guide for a\nstep-by-step guide illustrating basic creation of new content.","markdown-and-components#Markdown and Components":"Content is edited in the /content directory at the root of your Canopy IIIF project using .mdx files. In addition to the standard Markdown elements, Canopy IIIF provides a number of custom components that can be used to enhance the content of your site. These components are designed to be used in conjunction with Markdown to create a variety of content.","example-content#Example Content":"Content page with formatted Markdown elements, front matter, and an integrated <Viewer /> component to output a IIIF Viewer for a provided Manifest.","sample-mdx#Sample MDX":"---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nThe `<Viewer />` is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in. These Manifests can be part of the Canopy\nsource Collection but are not limited to it.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />","sample-output#Sample Output":""}},"/content/card":{"title":"Card","data":{"":"Implementers using Canopy IIIF can directly reference a single IIIF Manifest by using the Card component. The Card will render an HTML figure, the thumbnail and a figcaption containing the label of the Manifest. Use rendered figure will link to /work page for the relative Manifest.","properties#Properties":"Property\tType\tRequired\tDescription\tiiifContent\tstring\ttrue\tManifest URI to be rendered.\t\nThe referenced Manifest must be part of the IIIF Collection used in your Canopy project.","usage#Usage":"<Card iiifContent=\"https://manifests.collections.yale.edu/ycba/obj/702\" />"}},"/content/markdown":{"title":"Markdown","data":{"":"Canopy IIIF content pages are authored using Markdown in .mdx files.","elements#Elements":"Common Markdown elements are supported for use in Canopy IIIF content. Canopy will automatically transform content created in Markdown to HTML.\n# Iranian Cinema\n## Overview\nIranian cinema, also known as Persian cinema, stands out for its unique blend of artistry, storytelling, and cultural representation. It has gained significant international acclaim, especially for its poetic narrative style and sociocultural themes. Iranian cinema is a vibrant and influential part of the global film landscape, known for its poignant storytelling, artistic innovation, and cultural depth.\n## Characteristics\n- **Humanistic Approach**: Many films focus on everyday life and human relationships, reflecting broader societal issues.\n- **Artistic Storytelling**: Iranian cinema is renowned for its poetic, metaphorical narrative style.\n- **Minimalism**: There's often an emphasis on simplicity in both visual and narrative elements.\n## International Recognition\nIranian films have been celebrated at major international film festivals, including Cannes, Venice, and Berlin. Numerous awards have been won, highlighting the global impact of Iranian cinematic art.","front-matter#Front Matter":"At the top of each Markdown file, you can add front matter to provide additional information about the page. Front matter is written in YAML, and must be surrounded by --- on either side.\n---\ntitle: \"Title in Front Matter\"\n---","content-pages#Content Pages":"All new content pages created in the content directory can have the following front matter:","title#title":"The title of the page. This will be used in the HTML <title> and associated <meta> tags.","navigation#navigation":"The navigation menu for the page. This should be the relative directory path for the page. For example, if the page is in content/correspondence/, the navigation should be correspondence.","referencedmanifests#referencedManifests":"A list of IIIF Manifests URIs that are referenced in the content of the page. These Manifests MUST be a part of source IIIF Collection used for your Canopy project. These will create a link between the /work page and the current content page.\n---\ntitle: \"January 1955 Correspondence\"\nnavigation: \"correspondence\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/46de2c91-3a29-4525-939e-ee17073f3a7e?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/bb968afb-7857-46bd-9392-d8617a93cc9f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/14b8212b-7c49-431b-ad04-e4cd5cce6416?as=iiif\n---","home-page#Home Page":"The home page at content/index.mdx is a special content page with distinct front matter keys in addition to title.","showhero#showHero":"A boolean value that determines whether or not the hero image for featued Manifests should be shown on the home page. This renders above the Markdown content.","showhighlighted#showHighlighted":"A boolean value that determines whether or metadata sliders for highlighted items should be shown on the home page. This renders below the Markdown content if showHero is true\n---\ntitle: Amanda Ira Aldridge Correspondences\nshowHero: true\nshowHighlighted: true\n---"}},"/content/navigation":{"title":"Navigation","data":{"":"Navigation is configured from _meta.json files located in /content.","primary-navigation#Primary Navigation":"Canopy IIIF creates it's primary navigation at build time from /content/_meta_.json. Each link will have a path and text key. A path value will resolve to a file or directory under /content or /src/pages. The text key will be what's displayed in the navigation bar. The order of the links in the array will be the order they appear in the navigation.\n[\n  {\n    \"path\": \"/works\",\n    \"text\": \"Works\"\n  },\n  {\n    \"path\": \"/metadata\",\n    \"text\": \"Metadata\"\n  },\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  }\n]\nCanopy IIIF provides the Works and Metadata pages out of the box,\npre-configured. Therefore you will not see markdown files for these pages\nunder the /content directory, though their links will resolve.\nFor a more detailed explanation of how the path value is resolved, see below.\nTechnical explanation: The path value follows the\nNext.js\npages routing convention. The path value /works will map to\n/src/pages/works/index.tsx. The path value/metadata will map to\n/src/pages/metadata.tsx.","custom-content#Custom Content":"Most users will want to add navigation for custom content to their site. For example, a user may want to customize the navigation on the About page to better fit the content of their site or create a brand new page with custom navigation. This is done by creating a markdown file under /content and adding a link to the primary navigation (as seen above).\nFor example, to add a page called Essays to the primary navigation, create a markdown file called index.mdx under /content/essays.\nIf creating a new page, try copying the content from src/pages/about into\nsrc/pages/{your_page_name}. This will give you a good starting point for\nyour new page.","secondary-navigation#Secondary Navigation":"","top-level#Top Level":"Secondary navigation may be defined from within a _meta.json file located within a subdirectory of /content. For example, secondary navigation within About might look like this:\n[\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  },\n  {\n    \"path\": \"/about/example\",\n    \"text\": \"Markdown Example\"\n  }\n]\nWhich will render top-level secondary navigation links About and Markdown Example:\nThese About secondary navigation links are wired up to route to the corresponding markdown file. For example, clicking on Markdown Example will route to /content/about/example.Markdown Example must also define a navigation frontmatter property, identifying it's parent. This is used to render the top-level secondary navigation links. For example, the Markdown Example markdown file might look like this:\n---\ntitle: About\nnavigation: \"about\"\n---\nContent goes here","internal-page-navigation#Internal Page Navigation":"Internal page navigation links (ie. \"Use Cases\", \"Features\", and \"Colophon\") are automatically generated for heading level 2 elements (## Heading) in your Markdown content. For example, the About page might look like this:\n# About\nUsing a single [IIIF Presentation Collection](https://iiif.io/api/presentation/3.0/#overview-collection) as a data source, Canopy IIIF (Canopy) generates a browseable, searchable, customizable, and contextually-driven static site using Next.js without duplicating content.\n## Use Cases\nSome content here\n## Features\nSome content here\n## Colophon\nSome content here"}},"/content/referenced-items":{"title":"Referenced Items","data":{"":"The ReferencedItems component is used in conjunection with referencedManifests front matter key to easily render a grid of Card components. The referenced items must be Manifests within the IIIF Collection used in your Canopy project.\nSee Front Matter document for more\ninformation.","usage#Usage":"---\ntitle: \"January 1955 Correspondence\"\nnavigation: \"correspondence\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/46de2c91-3a29-4525-939e-ee17073f3a7e?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/bb968afb-7857-46bd-9392-d8617a93cc9f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/14b8212b-7c49-431b-ad04-e4cd5cce6416?as=iiif\n---\n<ReferencedItems />"}},"/content/slider":{"title":"Slider","data":{"":"Slider is a component that renders a Collection as a carousel component. Each item in the referenced IIIF Collection is rendered as an HTML figure, the thumbnail and a figcaption containing the label of the Manifest. Use rendered figure will link to /work page for the relative Manifest.","properties#Properties":"Property\tType\tRequired\tDescription\tiiifContent\tstring\ttrue\tIIIF Collection URI to be rendered.\t\nThis resource may OR may not be part of the IIIF Collection used in your Canopy project.\nIf the Collection is generated by Canopy, the homepage routes will automatically link to respective /work pages and /search facets.","usage#Usage":"<Slider iiifContent=\"/api/facet/creator/david-alfaro-siqueiros \" />"}},"/content/viewer":{"title":"Viewer","data":{"":"When creating content for Canopy, you can use the Viewer component to embed a deep-zoom and A/V capable IIIF Viewer into your content. The integrated IIIF Viewer is the Clover IIIF Viewer component","properties#Properties":"Property\tType\tRequired\tDescription\tiiifContent\tstring\ttrue\tIIIF Manifest or Collection URI to be rendered.\t\nThis resource may OR may not be part of the IIIF Collection used in your Canopy project.\nThe Viewer will render both IIIF Manifests and IIIF Collections.","usage#Usage":"<Viewer iiifContent=\"https://manifests.collections.yale.edu/ycba/obj/702\" />"}},"/create-markdown-content":{"title":"Create Markdown Content","data":{"":"Implementers of Canopy IIIF can author contextual content to support\nManifest resources using formatted Markdown files. These files are stored in\nthe /content directory of your project. In doing so, you can add context\nto items in your IIIF Collection and craft a custom experience using\nintegrated components provided by Canopy IIIF.\nThis guide assumes you have a Canopy IIIF project. See the Create a\nProject guide to get started.","use-case#Use Case":"As a digital humanist, you have authored scholarly content for distinct items in a IIIF Collection. Your aim is to publish a digital scholarship project that highlights your context alongside these items.","implementation#Implementation":"","create-a-markdown-file#Create a Markdown file":"In your content directory, find the about subdirectory and create the new file sample.mdx.\nAdd the following barebones Markdown and front matter to your file and save.\n---\ntitle: The Nez Percé (Nimíipuu)\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\nYour file is now accessible at the relative route /about/nez-perce. If running in development mode, your file is accessible at http://localhost:5001/about/nez-perce.","update-navigation-menu#Update Navigation Menu":"Add the navigation key to the front matter with the about value. In this example the about navigation menu is defined by the content/about/_meta.json file.\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\nEdit the content/about/_meta.json file and Add the new menu item to the array. Note that the /about/nez-perce path matches the relative path of the Markdown file.\n[\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  },\n  {\n    \"path\": \"/about/example\",\n    \"text\": \"Markdown Example\"\n  },\n  {\n    \"path\": \"/about/nez-perce\",\n    \"text\": \"The Nez Percé (Nimíipuu)\"\n  }\n]\nYou will see the menu rendered in the <aside> of the page after a browser refresh.","add-a-iiif-viewer#Add a IIIF Viewer":"Canopy IIIF provides a Clover IIIF Viewer component that can be used to display IIIF resources within Markdown.\nAdd a <Viewer /> component to the bottom of our Markdown file and directly reference a IIIF Manifest with the iiifContent property.\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nThe `<Viewer />` is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in. These Manifests can be part of the Canopy\nsource Collection but are not limited to it.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />\nThe IIIF viewer is now rendered at the bottom of the page. The viewer is responsive with a max-height.","reference-collection-items#Reference Collection Items":"As a digital humanist, you might have authored a series of essays in Markdown (in the /content directory), in which you wish to reference or cite one or more items in the source IIIF Collection. Canopy offers an easy method for linking scholarly content to items in their collection using the referencedManifests front matter key. This key takes an array of IIIF Manifest URIs. The Manifests MUST be in the source IIIF Collection of the Canopy project.\nAdd the referencedManifests key to the front matter with an array of Manifest URIs.\nAdd a <ReferencedItems /> component to bottom of our Markdown file. This will render the items as Figures in a responsive grid. Each item will have output relative local link to the item, a thumbnail, and the label.\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/84aec8c1-42e8-4e2c-a6b2-1c7e3790217f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/19efac1e-5e79-471c-89c2-a60a775562ce?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/ddd72f96-9869-4335-9d8c-3a3da51ad128?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/6caed4fb-60bc-4574-86a2-cb9a1859f78c?as=iiif\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nA IIIF viewer is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />\n## Referenced Items\nThe `<ReferencedItems />` automatically outputs a grid of items that are referenced by the current page.\n<ReferencedItems />\nYour page should now output a grid of items that are referenced in the front matter. Automatically, a reciprocal connection is made between the Markdown content and the items in the IIIF Collection. Users can now navigate to and from the scholarly content page and the relative /work page representing the Manifest.","leveraging-metadata-collections#Leveraging Metadata Collections":"During the Canopy build process, new unique metadata-based IIIF Collections are automatically generated from the source IIIF Collection. These Collections can be used within Markdown content to enhance user experience and your scholarly content.These new Collections are generated for label and value pairs defined of the metadata entries in a Canopy configuration file. The IIIF Collections are available at the URL pattern /api/facet/{label}/{value}.json. Generated IIIF Collections for these facets are logged in the Canopy build process, ex:\nCreating facets as IIIF Collections...\n↓ /api/facet/subject/cayuse-indians.json\n↓ /api/facet/subject/chinookan-indians.json\n↓ /api/facet/subject/nez-perce-indians.json\n↓ /api/facet/subject/tlakluit-indians.json\n↓ /api/facet/subject/umatilla-indians.json\n↓ /api/facet/subject/walla-walla-indians.json\n↓ /api/facet/date/1910.json\n↓ /api/facet/date/1909.json\n↓ /api/facet/date/1905.json\n↓ /api/facet/date/1911.json\n↓ /api/facet/date/1903.json\nAdd a <Viewer /> component to the bottom of our Markdown file and reference a collection for label of Date and value of 1905 with the iiifContent property. The iiifContent property URI can be either a relaltive or absolute path.\n<Viewer iiifContent=\"/api/facet/date/1905.json\" />\nOr, Add a <Slider /> component as an alternative view to render a carousel of items that link to the local relative /work pages representing the Manifests. This component takes the same iiifContent property. Note that this component only supports Collection resources.\n<Slider iiifContent=\"/api/facet/date/1905.json\" />\n---\ntitle: The Nez Percé (Nimíipuu)\nnavigation: \"about\"\nreferencedManifests:\n  - https://api.dc.library.northwestern.edu/api/v2/works/84aec8c1-42e8-4e2c-a6b2-1c7e3790217f?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/19efac1e-5e79-471c-89c2-a60a775562ce?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/ddd72f96-9869-4335-9d8c-3a3da51ad128?as=iiif\n  - https://api.dc.library.northwestern.edu/api/v2/works/6caed4fb-60bc-4574-86a2-cb9a1859f78c?as=iiif\n---\n# The Nez Percé (Nimíipuu)\nThis a sample page for scholarly content with historical context relating to the [Nez Percé](https://en.wikipedia.org/wiki/Nez_Perce), also known as the Nimíipuu.\n## A IIIF Viewer\nA IIIF viewer is a React component that takes a single property, `iiifContent`, which is the URI to the\nIIIF manifest. The component will then fetch the Manifest and render a deep-zoom viewer. The viewer is\nresponsive and will resize to fit the container it is placed in.\n<Viewer iiifContent=\"https://api.dc.library.northwestern.edu/api/v2/works/14a6aa15-9e12-47a7-9617-91f430d4f47b?as=iiif\" />\n## Referenced Items\nThe `<ReferencedItems />` automatically outputs a grid of items that are referenced by the current page.\n<ReferencedItems />\n## Leveraging Metadata\n### Using the Viewer\nThe `<Viewer />` component supports IIIF Collections. This allows you to reference a IIIF Collection that is generated by Canopy IIIF. In this example, we are referencing a Collection of items that have a `date` of `1905`.\n<Viewer iiifContent=\"/api/facet/date/1905.json\" />\n### Using the Slider\nAlternatively, you can use the `<Slider />` component to render a carousel of items that link to the local relative `/work` pages representing the Manifests.\n<Slider iiifContent=\"/api/facet/date/1905.json\" />"}},"/customize-the-search-index":{"title":"Customize the Search Index","data":{"":"Under the hood Canopy uses\nFlexSearch to power the search\nindex. FlexSearch is a full-text, memory efficient, search library that is\nfast and easy to use. It is also highly customizable. Canopy provides a\nnumber of ways to customize the search index.\nThis guide assumes you have a Canopy IIIF project. See the Create a\nProject guide to get started.","use-case#Use Case":"You'd like to use Canopy IIIF to create a digital exhibit featuring Arabic manuscripts. For example, this NUL Collection of Arabic Manuscripts from West Africa. The IIIF Manifest data contains both Arabic and English text in its label and summary properties.You'd like to customize search configuration in the following three ways:\nSupport the \"Arabic\" character set in Search (in addition to default \"Latin\").\nInclude text from a Manifest's summary values in search results.\nInclude additional Manifest metadata in search results. In our example Manifests we include \"Contributor\" and \"Alternate Title\" as metadata items and would like to surface these in search results.","implementation#Implementation":"","support-additional-language-encodings#Support additional language encoding(s)":"Open /config/options.json and add support for Arabic text.\nAdd \"arabic:extra\" to the search.flexSearch.charset property.\n{\n  ...\n  \"search\": {\n    \"enabled\": true,\n    \"flexSearch\": {\n      \"bidirectional\": false,\n      \"charset\": [\"latin:extra\", \"arabic:extra\"],\n      \"document\": {\n        \"index\": [\n          {\n            \"bidirectional\": true,\n            \"depth\": 3,\n            \"field\": \"label\",\n            \"resolution\": 9,\n            \"tokenize\": \"full\"\n          },\n          {\n            \"field\": \"metadata\",\n            \"resolution\": 2\n          },\n          {\n            \"field\": \"summary\",\n            \"resolution\": 1\n          }\n        ]\n      },\n      \"optimize\": true,\n      \"tokenize\": \"strict\"\n    },\n    \"index\": {\n      \"metadata\": {\n        \"all\": false,\n        \"enabled\": true\n      },\n      \"summary\": {\n        \"enabled\": true\n      }\n    }\n  },\n  ...\n}\nRestart your development server to see the changes.","include-summary-in-search-results#Include summary in search results":"Canopy IIIF's default search configuration, indexes\nonly a Work Manifest's label and metadata values.\nTo include a Manifest's summary value in search results, you'll need to update the search.index.summary.enabled property.\nIn /config/options.json set the value of search.index.summary.enabled to be true.\n{\n  ...\n  \"search\": {\n    \"enabled\": true,\n    \"flexSearch\": {\n      \"bidirectional\": false,\n      \"charset\": [\"latin:extra\", \"arabic:extra\"],\n      \"document\": {\n        \"index\": [\n          {\n            \"bidirectional\": true,\n            \"depth\": 3,\n            \"field\": \"label\",\n            \"resolution\": 9,\n            \"tokenize\": \"full\"\n          },\n          {\n            \"field\": \"metadata\",\n            \"resolution\": 2\n          },\n          {\n            \"field\": \"summary\",\n            \"resolution\": 1\n          }\n        ]\n      },\n      \"optimize\": true,\n      \"tokenize\": \"strict\"\n    },\n    \"index\": {\n      \"metadata\": {\n        \"all\": false,\n        \"enabled\": true\n      },\n      \"summary\": {\n        \"enabled\": true\n      }\n    }\n  },\n  ...\n}\nRestart your development server to see the changes.","include-custom-metadata-in-search-results#Include custom metadata in search results":"In /config.canopy.json, you can index all, part, or none of a Work Manifest's metadata values.\nBy default, Canopy IIIF indexes all metadata fields.\nIn this example, we only want to target specific metadata fields, \"Date\", \"Subject\",\n\"Contributor\", and \"Alternate Title\".\nOpen /config/canopy.json\nDepending on which environment you'd like to target (dev or prod) provide an array of metadata fields you'd like exposed in search results. (In the example Manifest we include \"Date\", \"Subject\", \"Contributor\" and \"Alternate Title\" as metadata items)\nIn this example, we'll update the dev configuration:\n{\n  \"dev\": {\n    \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/search?query=collection.id:%2259ec43f9-a96c-4314-9b44-9923790b371c%22&as=iiif\",\n    \"featured\": [\n      \"https://api.dc.library.northwestern.edu/api/v2/works/2ca1b09b-cbad-43dd-82bf-a7fa807269d8?as=iiif\"\n    ],\n    \"label\": {\n      \"none\": [\"Western Africa Manuscripts\"]\n    },\n    \"metadata\": [\"Date\", \"Subject\", \"Contributor\", \"Alternate Title\"],\n    \"summary\": {\n      \"none\": [\"Brief description of the site and its contents.\"]\n    }\n  },\n  \"prod\": {...}\n}\nRestart your development server to see the changes.\nPro tip: To visually confirm text being indexed for search, open the file\n.canopy/index.json and verify your custom data is being indexed.","validate-search-customizations#Validate search customizations":"Verify your customizations are working by searching for:\nAn Arabic phrase (e.g. \"مجموع الفوائد.\")\nA Manifest summary value (e.g. \"Fāʼidah of Prophet Yūsuf on gaining people's love and respect.\")\nA Manifest metadata value (e.g. \"Falke\", or \"Prophet Yūsuf\")"}},"/deploy-to-github-pages":{"title":"Deploy to GitHub Pages","data":{"":"Canopy IIIF is designed to be deployed as a statically generated website.\nStatic sites are a great option for many projects, as they are fast, secure,\nand easy to deploy and maintain. This guide will walk you through the\nprocess of deploying project as a static website using GitHub Pages using\nthe incorporated GitHub Actions in Canopy to automate the build and\ndeployment process.\nRequires a GitHub account.","use-case#Use Case":"You are a graduate student researching the American painter Beauford Delaney\nand you would like to easily create and host a digital scholarship project\nanalyzing items in your institution's digital collections.","implementation#Implementation":"","create-your-template-repository#Create your template repository":"Click the \"Use this template\" button at the top of the Canopy IIIF\nrepository to create a new repository based on this template. Select \"Create a new repository\" and choose the GitHub\naccount or organization you want to copy the contents to from the Owner dropdown. Choose a name for your new repository\nand entire it in the Repository name field. Unless you have a paid GitHub account, select Public. Click the\n\"Create repository\" button to create the new repository.","adjust-repository-settings#Adjust repository settings":"Once the repository is created, press the Settings button and Actions → General under Code and automation.Then select Read and write permissions under Workflow permissions and press Save. This allows the GitHub\nworkflow to run and the static Canopy output to be deployed to a new branch.","modify-environmmental-variables#Modify environmmental variables":"Next, modify the .github/workflows/gh-pages.deploy.yml file in repository for the NEXT_PUBLIC_URL and NEXT_PUBLIC_BASE_PATH\nto be relative to the new repository. After changing these settings, commit your change and trigger the action to run.\nOnce the action has run, the action indicator should change from a red X to a green check mark and a new branch called\ngh-pages will be created.","watch-the-build#Watch the build":"Once the gh-pages branch exists and the action indicator is a green check mark, again press the Settings button.\nUnder Code and automation, click Pages and select gh-pages from the Branch dropdown under Build and deployment\nand click *Save.","validate-the-url#Validate the URL":"Now your Canopy site will be active at a URL derived from values you defined in the NEXT_PUBLIC_URL and NEXT_PUBLIC_BASE_PATH settings.i.e. https://[NEXT_PUBLIC_URL]/[NEXT_PUBLIC_BASE_PATH]You can also view your live domain in Github by clicking the top Settings button, and then under Code and automation -> Pages."}},"/deploy-to-vercel":{"title":"Deploy to Vercel","data":{"":"Canopy can be deployed to a Next.js managed hosting\nservice.\nDoing so will allow you to take advantage of server-side components (e.g.,\nAPI routing). This guide will walk you through the process of\ndeploying Canopy to Vercel.\nRequires a Vercel account.","use-case#Use Case":"You are developer tasked with using Canopy and leveraging API routing to serve the /api/search\nendpoint as IIIF for Collections-as-data purposes. As part of this requirement, you need to deploy\nthe application to a managed hosting service and have selected Vercel for its Next.js compatibility.","implementation#Implementation":"","import-the-repository#Import the Repository":"After you've logged in to Vercel, click the Start deploying button. Then, from the Let's Build Something New\nscreen, click the Import button next to the repository you've created.","configure#Configure":"Next, give your repository a name a press Deploy. Vercel will then build and deploy your application and make it available at ${YOUR-PROJECT-NAME}.vercel.app.","environment-variables#Environment Variables":"Finally, edit the .env in your repository on Github and make sure that the NEXT_PUBLIC_URL variable and\nNEXT_PUBLIC_BASE_PATH variables match your project in Vercel. By default, the NEXT_PUBLIC_URL variable should be\nsimilar to your project name and you should not have to modify NEXT_PUBLIC_BASE_PATH."}},"/development":{"title":"Development","data":{"environment#Environment":"When you are ready to deploy your site, you will need to modify environment variables to reflect how your site is hosted.","updating#Updating":"Edit the .env file at the root of the working directory to reflect your site's configuration.The NEXT_PUBLIC_URL variable is used to declare the base URL of your site. This base url is critical to routing of works in Canopy and wiring up canonical links in SEO.If you plan to host your site in a subdirectory or subdomain, you will need to set the NEXT_PUBLIC_BASE_PATHto reflect this. For example, if your site is hosted at https://example.org/exhibit, you would set the value to /canopy.\nNEXT_PUBLIC_URL = \"https://canopy-iiif.vercel.app\"\nNEXT_PUBLIC_BASE_PATH = \"\"","avoid-code-conflicts#Avoid Code Conflicts":"To avoid potential code conflicts on future release updates, it is advised not to update the following integrated Canopy pages in the Next.js pages directory.\nNote: Future considerations will be delivered upon for updating content within these pages."}},"/enable-a-map-with-navPlace":{"title":"Enable a Map with navPlace Properties","data":{"":"Canopy IIIF allows users to explore the underlying collection through an\ninteractive map. When activated, this component displays a map featuring\nmarkers representing each point Feature within the navPlace properties found throughout the Manifests of the overarching collection. This guide will walk\nyou through the process of enabling the Map component in Canopy IIIF.\nThe Map component is populated by Manifests with a navPlace property. For more information, see the IIIF navPlace extension specification.","use-case#Use Case":"You are a digital scholar with geospatial point data and you would like to enable\nthe Map component to create additional access points for Manifests in your IIIF Collection.You would like to customize the map component by:\nusing a topographic map as the default tile layer with a street map as an optional additional layer\nusing a custom icon for the markers","implementation#Implementation":"","add-navplace-properties-to-the-manifests-in-your-collection#Add navPlace Properties to the Manifests in your collection":"Currently, Canopy only leverages the navPlace properties found in manifests with geometry\nproperties of type Point.\nCanopy IIIF's map component, is driven by navPlace properties found in the manifests of the\noverarching collection.Before the map component can be enabled, you must add navPlace properties to the manifests in your collection.\nIn accordance with the specification, include the navPlace extension to the Linked Data Context of each manifest by adding\nhttps://iiif.io/api/extension/navplace/context.json to the @context property before\nhttp://iiif.io/api/presentation/3/context.json.\n{\n  \"@context\": [\n    \"https://iiif.io/api/extension/navplace/context.json\",\n    \"http://iiif.io/api/presentation/3/context.json\"\n  ],\n  ...\n}\nAdd the navPlace property to each manifest with a FeatureCollection and at least one Feature of type Point.\nEach Feature should include a label property that will be used as the text for the corresponding marker. The\ncoordinates array should include the longitude and latitude coordinates of the Feature with the longitude\nappearing first.\n{\n  ...\n  \"navPlace\": {\n    \"id\": \"https://digital.lib.utk.edu/notdereferenceable/featurecollection//1\",\n    \"type\": \"FeatureCollection\",\n    \"features\": [\n      {\n        \"id\": \"https://digital.lib.utk.edu/notdereferenceable/feature/1\",\n        \"type\": \"Feature\",\n        \"properties\": {\n          \"label\": {\n            \"en\": [\n              \"Interview with Seemona and Daniel Whaley, 2019-09-20 -- Discussion of Gatlinburg, TN\"\n            ]\n          }\n        },\n        \"geometry\": {\n          \"type\": \"Point\",\n          \"coordinates\": [\n            -83.51189,\n            35.71453\n          ]\n        }\n      }\n    ]\n  }\n  ...\n}","enable-the-map-component#Enable the Map Component":"Enable the map component by changing map.enabled to true in your config/options.json file.\n{\n  ...\n    \"map\": {\n        \"defaultBounds\": [[51.505, -0.09]],\n        \"enabled\": true,\n        \"icon\": {\n            \"iconUrl\": \"images/marker-icon.png\",\n            \"iconSize\": [24, 36],\n            \"iconAnchor\": [12, 36]\n        }\n    },\n  ...\n}","modify-tile-layers#Modify Tile Layers":"Modify the tileLayers property by moving the OpenTopMap layer to the top of the array.\nDelete all tileLayers after the OpenStreetMap layer.\n{\n  ...\n    \"map\": {\n        \"defaultBounds\": [[51.505, -0.09]],\n        \"enabled\": true,\n        \"icon\": {\n            \"iconUrl\": \"images/marker-icon.png\",\n            \"iconSize\": [24, 36],\n            \"iconAnchor\": [12, 36]\n        }\n        \"tileLayers\": [\n          {\n            \"name\": \"OpenTopoMap\",\n            \"url\": \"https://{s}.tile.opentopomap.org/{z}/{x}/{y}.png\",\n            \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n          },\n          {\n            \"name\": \"OpenStreetMap\",\n            \"url\": \"https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png\",\n            \"attribution\": \"&copy; <a href=\\\"https://www.openstreetmap.org/copyright\\\">OpenStreetMap</a> contributors\"\n          }\n        ]\n    },\n  ...\n}","modify-the-marker-icon#Modify the Marker Icon":"Replace the iconUrl property with the path to your custom icon. This can be a remote resource that is served from\nanother website or a local resource that is served from your public/images directory in Canopy.\nIf the size of your icon is different than the default size of 24px by 36px, modify the iconSize.\nSimilarly, if the anchor point of your icon is different than the default anchor point of 12px by 36px, modify\nthe point of the icon which will correspond to marker's location in iconAnchor.\n{\n  ...\n    \"map\": {\n        \"defaultBounds\": [[51.505, -0.09]],\n        \"enabled\": true,\n        \"icon\": {\n            \"iconUrl\": \"https://raw.githubusercontent.com/pointhi/leaflet-color-markers/master/img/marker-icon-violet.png\",\n            \"iconSize\": [24, 36],\n            \"iconAnchor\": [12, 36]\n        }\n    },\n  ...\n}","add-the-map-route-to-your-navigation#Add the Map Route to your Navigation":"Add the map route to your content/_meta.json file so that it appears in the Navigation bar.\n[\n  {\n    \"path\": \"/works\",\n    \"text\": \"Works\"\n  },\n  {\n    \"path\": \"/metadata\",\n    \"text\": \"Metadata\"\n  },\n  {\n    \"path\": \"/map\",\n    \"text\": \"Map\"\n  },\n  {\n    \"path\": \"/about\",\n    \"text\": \"About\"\n  }\n]"}},"/get-started":{"title":"Create a Canopy Project","data":{"":"Have a project in mind? Let's get started! This guide will walk you through\nthe process of creating a basic Canopy IIIF project using a readily provided\nIIIF Collection.","use-case#Use Case":"You are on a team at a university library seeking to create a digital exhibit for a Korean Literary\ncollection in your digital repository that is provided as a IIIF Collection. You want to create\na discovery focused web site that allows users to search and browse the collection.","implementation#Implementation":"","create-a-project#Create a project":"","using-a-github-template#Using a Github template":"This method requires a GitHub account; however, it\nshould be easier to follow for users of Canopy without a developer\nenvironment.\nNavigate to the Canopy IIIF repository in GitHub\nClick the \"Use this template\" button\nClick the \"Create a new repository\" button\nSelect the account you want to own the repository\nEnter a repository name and optional description\nClick the \"Create repository\" button","using-git-clone#Using git clone":"In your terminal, navigate to the a working directory where you want to create your project\nClone the canopy-iiif/canopy-iiif repository OR your Canopy repository instance\ncd ~/Projects\ngit clone git@github.com:canopy-iiif/canopy-iiif.git","install-dependencies#Install dependencies":"Navigate to your new project directory and install dependencies.\ncd canopy-iiif\nnpm install","create-configuration-file#Create configuration file":"Copy the example configuration file and update the prod and dev values with your IIIF Collection URL. See Configuration for detailed documentation.\ncp config/canopy.sample.json config/canopy.json\nIn this example we will use the Korean Literary Collection IIIF Collection URL provided by University of Washington Libraries.\ncollection is the IIIF Collection URI to be used as the root of your Canopy IIIF site\nfeatured array is a list of Manifest URIs that will be promoted thoughout your Canopy IIIF site\nmetadata array is a list of metadata labels that match string values in your Manifest URI metadata entries to be used for discovery purposes\n{\n  \"prod\": {\n    \"collection\": \"https://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\",\n    \"featured\": [\n      \"https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json\"\n    ],\n    \"metadata\": [\"Author\", \"Place of Publication\"]\n  },\n  \"dev\": {\n    \"collection\": \"https://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\",\n    \"featured\": [\n      \"https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json\"\n    ],\n    \"metadata\": [\"Author\", \"Place of Publication\"]\n  }\n}\nSee Options for more information regarding configuration.","ready-to-go#Ready to go!":"If you are using GitHub, you can skip this step and run Canopy without a\ndeveloper environment directly using GitHub Pages.\nNow that you have a project and configuration set, you can run Canopy IIIF.\nnpm run dev","build-process#Build process":"The build process may take a few minutes depending on the size of your IIIF Collection and provider response times. A Collection of ~100 items should build in 30 seconds or less.\nBuilding - Canopy retrieves the source IIIF Collection\nCreate Manifest listing - Canopy retrives all IIIF Manifests in the Collection\nCreate facets as IIIF Collections - Canopy anaylzes the Manifests and creates IIIF Collections for each unique metadata label and value\nBuild search entries - Canopy is creates search entries for each Manifest from descriptive metadta\nReady 🚀 - Canopy is ready to go!\nBuilding Canopy from IIIF Collection...\nhttps://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\nCreating Manifest listing...\nAggregating 135 Manifest(s) in 14 chunk(s)...\nChunk (1/14)\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:560/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1494/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:678/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:983/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:314/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1105/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:498/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:839/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1363/manifest.json ➜ 200\n## build continues...\nChunk (14/14)\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28181/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:27749/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28140/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28280/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:27976/manifest.json ➜ 200\n135/135 Manifests(s) retrieved successfully.\nCreating facets as IIIF Collections...\n↓ /api/facet/author/unidentified.json\n↓ /api/facet/author/kim-tong-in.json\n↓ /api/facet/author/chng-chi-yong-chong-chi-yong.json\n↓ /api/facet/author/yi-tae-jun.json\n↓ /api/facet/author/an-hoe-nam.json\n↓ /api/facet/author/im-hak-su.json\n## build continues...\nBuilding search entries...\n...Ready 🚀\n▲ Next.js 13.5.4\n- Local:        http://localhost:5001\n- Environments: .env","browse-your-site#Browse your site":"In your browser, navigate to http://localhost:5001 to view your Canopy IIIF site.","home-page#Home page":"Content on the home page is geared towards discovery of your IIIF Collection. The home page will render a hero component for featured Manifests and a slider components for defined metadata labels and their most common values.","search-page#Search page":"All Manifests in your IIIF Collection are now represented as results at the /search route. In addition to full text search, results are filterable by defined metadata labels and available values. In the example Korean Literary Collection, there are 135 items available for search. A query for poems returns 43 results.","work-page#Work page":"All Manifests in your IIIF Collection are now available as statically generated pages with a /work/slug-generated-from-label pattern. Each work represents a single Manifest, its descriptive metadata, and various other IIIF properties. Clover IIIF is the defacto deep-zoom and A/V capable viewer in Canopy IIIF but other IIIF viewers can be easily configured."}},"/guides":{"title":"User Guides","data":{"":"To get started with Canopy IIIF, check out the following guides that provide step-by-step instructions."}},"/":{"title":"Canopy  IIIF","data":{"":"{\n  \"@context\": \"http://iiif.io/api/presentation/3/context.json\",\n  \"id\": \"https://collections.britishart.yale.edu/iiif/collection/paintings_of_francis_danby\",\n  \"type\": \"Collection\",\n  \"label\": {\n    \"en\": [\"Paintings of Francis Danby\"]\n  },\n  \"items\": [\n    {\n      \"id\": \"https://manifests.collections.yale.edu/ycba/obj/116\",\n      \"type\": \"Manifest\",\n      \"label\": {\n        \"en\": [\"The Mountain Torrent\"]\n      }\n    },\n    {\n      \"id\": \"https://manifests.collections.yale.edu/ycba/obj/38658\",\n      \"type\": \"Manifest\",\n      \"label\": {\n        \"en\": [\"A View across the Artist's Garden from his House at Exmouth, Devonshire\"]\n      }\n    }\n  ]\n}\nWhat is Canopy IIIF?\nCanopy is an open source site generator built with\nIIIF and Next.js. Using a IIIF\nCollection as a data\nsource, Canopy IIIF generates a browseable and searchable static site and\nprovides a straightforward solution using Markdown for adding scholary context\nto the resources that are referenced.\nScholarship\nResearchers can curate and aggregate content from various providers and\nadd their own context to resources\nExhibits\nLibraries, museums, and archives can create digital exhibits from the\nworks in their repositories\nMinimal infrastructure\nSmall-scale, headless infrastructure for institutions with limited\nresources to build their own digital collections application\nFeatures\nCanopy IIIF extends the features of Next.js to produce a full-text search\nindex using FlexSearch, provides support for both IIIF Presentation API\n2.x and 3.0 specifications, and automatically generates facets based on\nthe curated metadata labels and values found within Manifests. The\nplatform’s API routes return IIIF collections and allow for users to\nreference IIIF resources internally and externally. In addition to these\nfeatures, the product roadmap and planned features include expanding\ninternationalization support, generating interactive maps and timelines\nbased on the presence of navPlace and navDate properties, and leveraging\nIIIF Content State and Change Discovery APIs."}},"/stackblitz":{"title":"StackBlitz Playground","data":{"":"Want to quickly try out Canopy? Click the button below to open a\nStackBlitz playground.","use-cases#Use Case(s)":"You don't want to install Canopy locally or be concerned with a developer environment.\nYou want to quickly experiment with config, settings, and or target Collections.\nYou'd like to showcase a IIIF-driven project for your team or colleagues.\nThere may be CORS issues rendering images in Safari and Firefox browsers. If\nyou're experiencing broken images, please try Chrome or Brave browsers.","implementation#Implementation":"","create-a-stackblitz-instance#Create a StackBlitz instance":"Click on the button above, \"Open in StackBlitz\". This will open a new browser tab and load the Canopy project in StackBlitz.","customize-canopy-collection#Customize Canopy Collection":"If you'd like to jump right into customizing or tinkering with config settings, try re-naming /config/canopy.sample.json to /config/canopy.json. This will override the default config settings and allow you to experiment with your own settings.\nWhen demoing in StackBlitz, your are in dev mode when configuring\n/config/canopy.json. This means that you can use the dev settings to\ntarget a IIIF Collection or Manifest.\nFor example, let's use the Charlotte Mormon Collection from Northwestern University Libaries.\n{\n  \"prod\": {\n    \"label\": { \"none\": [\"Collection Title\"] },\n    \"summary\": {\n      \"none\": [\"Brief description of the site and its contents.\"]\n    },\n    \"collection\": \"https://example.org/iiif/collection.json\",\n    \"featured\": [\n      \"https://example.org/manifest-1.json\",\n      \"https://example.org/manifest-2.json\"\n    ],\n    \"metadata\": [\"Date\", \"Subject\"]\n  },\n  \"dev\": {\n    \"label\": { \"none\": [\"Collection Title\"] },\n    \"summary\": {\n      \"none\": [\"Brief description of the site and its contents.\"]\n    },\n    \"collection\": \"https://api.dc.library.northwestern.edu/api/v2/search?query=collection.id:%22b46c9cf7-0e49-4993-9e0e-3cda030c4439%22&as=iiif\",\n    \"featured\": [],\n    \"metadata\": [\"Date\", \"Subject\"]\n  }\n}\nAfter making any configuration changes, you'll need to re-start the dev server (as you would have to in a local development environment also). StackBlitz gives access to a Terminal.\nClick into the Terminal and quit the dev server by pressing ctrl + c. Then, re-start the dev server by running npm run dev.","customize-canopy-options#Customize Canopy Options":"For example, you could experiment with customizing Search, following the Search Guide. To start customizing options, rename /config/options.sample.json to /config/options.json."}},"/configuration/theme":{"title":"Theme","data":{"":"The default theme for users can be set via config/options.json. This feature sets the initial theme for users as light, dark, or system. The Toggle Theme button can also be enabled or disabled here.Note: Theme settings are stored in the users local browser storage. Setting the theme will only affect new users to your site. It will not change the default theme for users who have already visited.","properties#Properties":"Property\tType\tDescription\tdefaultTheme\tenum\tSets the default theme for users.\ttoggleEnabled\tboolean\tEnables or disables the Toggle Theme button in the footer.","defaulttheme#defaultTheme":"Sets the default theme for users. The default value is light.\n\"defaultTheme\": \"light\" // \"light\" | \"dark\" | \"system\"","toggleenabled#toggleEnabled":"Boolean value that enables or disables the Toggle Theme button in the footer. The default value is true.\n\"toggleEnabled\": true","example-theme-configuration#Example Theme Configuration":"Example of the theme configuration in config/options.json file with a defaultTheme of light and the toggleEnabled set to false.\n{\n  \"theme\": {\n    \"defaultTheme\": \"light\",\n    \"toggleEnabled\": false\n  }\n}"}}}