{"/about":{"title":"About","data":{"":"The project name \"Canopy\" is inspired by the tree motiff in the presentation, A Tree's Strength Is Its Trunk: IIIF as Central Operational Infrastructure, delivered by María Matienzo (formerly Stanford University Libraries) and Esmé Cowles (Princeton University Library) at the CNI Fall 2020 Virtual Membership Meeting. Following this infrastructure vision, Canopy was created as a front end solution for rapid and easy creation of static sites using a IIIF Collection and its Manifests.Canopy IIIF is created using Next.js 13, with a FlexSearch index for text search, IIIF Presentation API 3.0 delivering resource content, Radix UI and Stitches used throughout for the user interface, and various community modules from IIIF Commons and Samvera supporting the work presentation and resource delivery.","origination#Origination":"Canopy was initially conceived at the University of Tennessee Libraries in the Summer '21 as a statically generated web application for the Rising from the Ashes: The Chimney Tops 2 Wildfires Oral History Project. This project was generated from a single IIIF Collection; however, the components delivering the user interface became heavily tailored to the source material of the Rising from the Ashes project, thus limiting the reuse of the codebase for other collections. The original Canopy featured a heavily integrated IIIF A/V Viewer designed to deliver Sound and Video resources. This A/V viewer would eventually evolve into a partial inspiration for Clover IIIF.Canopy was reimagined as Canopy IIIF in early Winter '22 with the primary focus of the project maintaining the the ability to build an interoperable site from any IIIF Collection following IIIF Presentation API 2.0 and 3.0 specifications.","contributors#Contributors":"Creators\nMat Jordan - Northwestern University\nLibraries, formerly University of Tennessee Libraries\nMark Baggett - University of Tennessee\nLibraries\nAdam Arling - Northwestern University\nLibraries\nAdditional Credits\nEmily Gore - University of Georgia Libraries, formerly University of Tennessee\nLibraries\nDavid Schober - Northwestern University Libraries\nMartim Passos - Instituto Moreira Salles\nTarje Lavik - University of Bergen Library"}},"/configuration":{"title":"Configuration","data":{}},"/configuration/featured":{"title":"Featured","data":{}},"/configuration/locale":{"title":"Locale","data":{}},"/configuration/map":{"title":"Map","data":{}},"/configuration/metadata":{"title":"Metadata","data":{}},"/configuration/search":{"title":"Search","data":{}},"/content":{"title":"Content","data":{}},"/content/components/card":{"title":"Card","data":{}},"/content/components/slider":{"title":"Slider","data":{}},"/content/components/viewer":{"title":"Viewer","data":{}},"/content/markdown":{"title":"Markdown","data":{}},"/content/navigation":{"title":"Navigation","data":{}},"/create-markdown-content":{"title":"Create Markdown Content","data":{}},"/deploy-to-github-pages":{"title":"Deploy to GitHub Pages","data":{"":"Canopy IIIF is designed to be deployed as a statically generated website.\nStatic sites are a great option for many projects, as they are fast, secure,\nand easy to deploy and maintain. This guide will walk you through the\nprocess of deploying project as a static website using GitHub Pages using\nthe incorporated GitHub Actions in Canopy to automate the build and\ndeployment process.\nRequires a GitHub account.","use-case#Use Case":"You are a graduate student researching the American painter Beauford Delaney\nand you would like to easily create and host a digital scholarship project\nanalyzing items in your institution's digital collections.","implementation#Implementation":"","create-your-template-repository#Create your template repository":"Click the \"Use this template\" button at the top of the Canopy IIIF\nrepository to create a new repository based on this template. Select \"Create a new repository\" and choose the GitHub\naccount or organization you want to copy the contents to from the Owner dropdown. Choose a name for your new repository\nand entire it in the Repository name field. Unless you have a paid GitHub account, select Public. Click the\n\"Create repository\" button to create the new repository.","adjust-repository-settings#Adjust repository settings":"Once the repository is created, press the Settings button and Actions → General under Code and automation.Then select Read and write permissions under Workflow permissions and press Save. This allows the GitHub\nworkflow to run and the static Canopy output to be deployed to a new branch.","modify-environmmental-variables#Modify environmmental variables":"Next, modify the .github/workflows/gh-pages.deploy.yml file in repository for the NEXT_PUBLIC_URL and NEXT_PUBLIC_BASE_PATH\nto be relative to the new repository. After changing these settings, commit your change and trigger the action to run.\nOnce the action has run, the action indicator should change from a red X to a green check mark and a new branch called\ngh-pages will be created.","watch-the-build#Watch the build":"Once the gh-pages branch exists and the action indicator is a green check mark, again press the Settings button.\nUnder Code and automation, click Pages and select gh-pages from the Branch dropdown under Build and deployment\nand click *Save. Now your Canopy site will be active at the URL you defined in the NEXT_PUBLIC_URL setting."}},"/customize-the-search-index":{"title":"Customize the Search Index","data":{}},"/deploy-to-vercel":{"title":"Deploy to Vercel","data":{"":"Canopy can be deployed to a Next.js managed hosting\nservice.\nDoing so will allow you to take advantage of server-side components (e.g.,\nAPI routing). This guide will walk you through the process of\ndeploying Canopy to Vercel.\nRequires a Vercel account.","use-case#Use Case":"You are developer tasked with using Canopy and leveraging API routing to serve the /api/search\nendpoint as IIIF for Collections-as-data purposes. As part of this requirement, you need to deploy\nthe application to a managed hosting service and have selected Vercel for its Next.js compatibility.","implementation#Implementation":"","import-the-repository#Import the Repository":"After you've logged in to Vercel, click the Start deploying button. Then, from the Let's Build Something New\nscreen, click the Import button next to the repository you've created.","configure#Configure":"Next, give your repository a name a press Deploy. Vercel will then build and deploy your application and make it available at ${YOUR-PROJECT-NAME}.vercel.app.","environment-variables#Environment Variables":"Finally, edit the .env in your repository on Github and make sure that the NEXT_PUBLIC_URL variable and\nNEXT_PUBLIC_BASE_PATH variables match your project in Vercel. By default, the NEXT_PUBLIC_URL variable should be\nsimilar to your project name and you should not have to modify NEXT_PUBLIC_BASE_PATH."}},"/enable-a-map-with-navPlace":{"title":"Enable a Map with Navplace","data":{}},"/get-started":{"title":"Create a Canopy Project","data":{"":"Have a project in mind? Let's get started! This guide will walk you through\nthe process of creating a basic Canopy IIIF project using a readily provided\nIIIF Collection.","use-case#Use Case":"You are on a team at a university library seeking to create a digital exhibit for a Korean Literary\ncollection in your digital repository that is provided as a IIIF Collection. You want to create\na discovery focused web site that allows users to search and browse the collection.","implementation#Implementation":"","create-a-project#Create a project":"","using-a-github-template#Using a Github template":"This method requires a GitHub account; however, it\nshould be easier to follow for users of Canopy without a developer\nenvironment.\nNavigate to the Canopy IIIF repository in GitHub\nClick the \"Use this template\" button\nClick the \"Create a new repository\" button\nSelect the account you want to own the repository\nEnter a repository name and optional description\nClick the \"Create repository\" button","using-git-clone#Using git clone":"In your terminal, navigate to the a working directory where you want to create your project\nClone the canopy-iiif/canopy-iiif repository OR your Canopy repository instance\ncd ~/Projects\ngit clone git@github.com:canopy-iiif/canopy-iiif.git","install-dependencies#Install dependencies":"Navigate to your new project directory and install dependencies.\ncd canopy-iiif\nnpm install","create-configuration-file#Create configuration file":"Copy the example configuration file and update the prod and dev values with your IIIF Collection URL.\ncp config/canopy.sample.json config/canopy.json\nIn this example we will use the Korean Literary Collection IIIF Collection URL provided by University of Washington Libraries.\ncollection is the IIIF Collection URI to be used as the root of your Canopy IIIF site\nfeatured array is a list of Manifest URIs that will be promoted thoughout your Canopy IIIF site\nmetadata array is a list of metadata labels that match string values in your Manifest URI metadata entries to be used for discovery purposes\n{\n  \"prod\": {\n    \"collection\": \"https://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\",\n    \"featured\": [\n      \"https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json\"\n    ],\n    \"metadata\": [\"Author\", \"Place of Publication\"]\n  },\n  \"dev\": {\n    \"collection\": \"https://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\",\n    \"featured\": [\n      \"https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json\"\n    ],\n    \"metadata\": [\"Author\", \"Place of Publication\"]\n  }\n}\nSee Options for more information regarding configuration.","ready-to-go#Ready to go!":"If you are using GitHub, you can skip this step and run Canopy without a\ndeveloper environment directly using GitHub Pages.\nNow that you have a project and configuration set, you can run Canopy IIIF.\nnpm run dev","build-process#Build process":"The build process may take a few minutes depending on the size of your IIIF Collection and provider response times. A Collection of ~100 items should build in 30 seconds or less.\nBuilding - Canopy retrieves the source IIIF Collection\nCreate Manifest listing - Canopy retrives all IIIF Manifests in the Collection\nCreate facets as IIIF Collections - Canopy anaylzes the Manifests and creates IIIF Collections for each unique metadata label and value\nBuild search entries - Canopy is creates search entries for each Manifest from descriptive metadta\nReady 🚀 - Canopy is ready to go!\nBuilding Canopy from IIIF Collection...\nhttps://digitalcollections.lib.washington.edu/iiif/2/korean/manifest.json\nCreating Manifest listing...\nAggregating 135 Manifest(s) in 14 chunk(s)...\nChunk (1/14)\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:560/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1494/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:678/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:983/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:138/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:314/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1105/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:498/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:839/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:1363/manifest.json ➜ 200\n## build continues...\nChunk (14/14)\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28181/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:27749/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28140/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:28280/manifest.json ➜ 200\n✓ https://cdm16786.contentdm.oclc.org/iiif/korean:27976/manifest.json ➜ 200\n135/135 Manifests(s) retrieved successfully.\nCreating facets as IIIF Collections...\n↓ /api/facet/author/unidentified.json\n↓ /api/facet/author/kim-tong-in.json\n↓ /api/facet/author/chng-chi-yong-chong-chi-yong.json\n↓ /api/facet/author/yi-tae-jun.json\n↓ /api/facet/author/an-hoe-nam.json\n↓ /api/facet/author/im-hak-su.json\n## build continues...\nBuilding search entries...\n...Ready 🚀\n▲ Next.js 13.5.4\n- Local:        http://localhost:5001\n- Environments: .env","browse-your-site#Browse your site":"In your browser, navigate to http://localhost:5001 to view your Canopy IIIF site.","home-page#Home page":"Content on the home page is geared towards discovery of your IIIF Collection. The home page will render a hero component for featured Manifests and a slider components for defined metadata labels and their most common values.","search-page#Search page":"All Manifests in your IIIF Collection are now represented as results at the /search route. In addition to full text search, results are filterable by defined metadata labels and available values. In the example Korean Literary Collection, there are 135 items available for search. A query for poems returns 43 results.","work-page#Work page":"All Manifests in your IIIF Collection are now available as statically generated pages with a /work/slug-generated-from-label pattern. Each work represents a single Manifest, its descriptive metadata, and various other IIIF properties. Clover IIIF is the defacto deep-zoom and A/V capable viewer in Canopy IIIF but other IIIF viewers can be easily configured."}},"/":{"title":"Index","data":{"":"{\n  \"@context\": \"http://iiif.io/api/presentation/3/context.json\",\n  \"id\": \"https://collections.britishart.yale.edu/iiif/collection/paintings_of_francis_danby\",\n  \"type\": \"Collection\",\n  \"label\": {\n    \"en\": [\"Paintings of Francis Danby\"]\n  },\n  \"items\": [\n    {\n      \"id\": \"https://manifests.collections.yale.edu/ycba/obj/116\",\n      \"type\": \"Manifest\",\n      \"label\": {\n        \"en\": [\"The Mountain Torrent\"]\n      }\n    },\n    {\n      \"id\": \"https://manifests.collections.yale.edu/ycba/obj/38658\",\n      \"type\": \"Manifest\",\n      \"label\": {\n        \"en\": [\"A View across the Artist's Garden from his House at Exmouth, Devonshire\"]\n      }\n    }\n  ]\n}","what-is-canopy#What is Canopy?":"Canopy IIIF is an open source site generator built with IIIF and Next.js. Using a IIIF Collection as a data source, Canopy IIIF generates a browseable and searchable static site and provides a straightforward solution using Markdown for adding scholary context to the resources that are referenced.","use-cases#Use Cases":"","research#Research":"Researchers can curate and aggregate content from various providers and add their own context to resources","exhibits#Exhibits":"Libraries, museums, and archives can create digital exhibits from the works in their repositories","minimal-infrastructure#Minimal infrastructure":"Small-scale, headless infrastructure for institutions with limited resources to build their own digital collections application","features#Features":"Canopy IIIF extends the features of Next.js to produce a full-text search index using FlexSearch, provides support for both IIIF Presentation API 2.x and 3.0 specifications, and automatically generates facets based on the curated metadata labels and values found within Manifests. The platform’s API routes return IIIF collections and allow for users to reference IIIF resources internally and externally. In addition to these features, the product roadmap and planned features include expanding internationalization support, generating interactive maps and timelines based on the presence of navPlace and navDate properties, and leveraging IIIF Content State and Change Discovery APIs."}}}